S0DX/esp8266-powerstrip/src/web_config.cpp
#include "web_config.h"
#include "wifi_mgr.h"
#include "gpio_mgr.h"
#include "config.h"
#include "energy_mgr.h"
#include "log_buffer.h"
#include <sys/time.h>
#include "sy7t609.h"
#include "mqtt_mgr.h"
#include <EEPROM.h>
#include <WiFiClient.h>
#include <ESP8266HTTPUpdateServer.h>
#include <ESP8266httpUpdate.h>
#include <StreamString.h>
#include <DNSServer.h>

std::unique_ptr<ESP8266WebServer> WebConfigServer::server_;
std::unique_ptr<ESP8266HTTPUpdateServer> httpUpdater_;
std::unique_ptr<DNSServer> dnsServer_;
void (*WebConfigServer::save_callback_)(const char*, const char*) = nullptr;

// P0: Web 请求优先级机制
volatile bool WebConfigServer::web_request_active_ = false;
unsigned long WebConfigServer::web_request_start_ = 0;

// /api/status 使用静态缓冲区，避免 1600 字节大数组压在栈上导致栈溢出
static char status_buf[1600];

// P0: Web 请求优先级机制实现
bool WebConfigServer::isWebRequestActive() {
    // 超时保护：50ms 后自动清除（防止死锁导致主循环永久跳过 SY7T609 读取）
    if (web_request_active_ && millis() - web_request_start_ > 50) {
        web_request_active_ = false;
    }
    return web_request_active_;
}

void WebConfigServer::markWebRequestStart() {
    web_request_active_ = true;
    web_request_start_ = millis();
}

void WebConfigServer::markWebRequestEnd() {
    web_request_active_ = false;
}

// P0: 关键 API 列表（WiFi 扫描期间仍需响应）
bool WebConfigServer::isCriticalApi(const String& uri) {
    return uri == "/" || uri == "/api/status" || uri == "/api/debug" ||
           uri == "/api/meter" || uri == "/api/relay" ||
           uri.startsWith("/api/connect") || uri == "/api/now";
}

static const char INDEX_HTML[] PROGMEM = R"rawliteral(<!DOCTYPE html>
<html>
<head>
<meta charset='UTF-8'>
<meta name='viewport' content='width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no'>
<title>智能插排</title>
<style>
*{margin:0;padding:0;box-sizing:border-box;-webkit-tap-highlight-color:transparent}
body{font-family:-apple-system,BlinkMacSystemFont,'SF Pro Text','Helvetica Neue',sans-serif;background:#f2f2f7;color:#1c1c1e;min-height:100vh;overflow-x:hidden}
.header{background:rgba(255,255,255,0.9);padding:16px 20px;border-bottom:1px solid #e5e5ea;position:sticky;top:0;z-index:100;text-align:center;display:flex;justify-content:space-between;align-items:center}
.header h1{font-size:18px;font-weight:600}
.card{background:#fff;border-radius:12px;margin:16px;padding:16px;box-shadow:0 1px 3px rgba(0,0,0,0.08)}
.card-title{font-size:12px;color:#8e8e93;text-transform:uppercase;letter-spacing:.5px;margin-bottom:12px}
.grid{display:flex;gap:10px}
.grid-item{flex:1;background:#f2f2f7;border-radius:10px;padding:14px 8px;text-align:center}
.grid-item .val{font-size:22px;font-weight:600;color:#007aff}
.grid-item .lbl{font-size:10px;color:#8e8e93;margin-top:4px}
.switch-row{display:flex;justify-content:space-between;align-items:center;padding:14px 0;border-bottom:1px solid #e5e5ea}
.switch-row:last-child{border-bottom:none}
.switch-row .lbl{font-size:15px}
.toggle{width:51px;height:31px;background:#e9e9eb;border-radius:16px;position:relative;transition:background .3s;cursor:pointer}
.toggle.on{background:#34c759}
.toggle::after{content:'';width:27px;height:27px;background:#fff;border-radius:50%;position:absolute;top:2px;left:2px;transition:transform .3s;box-shadow:0 2px 4px rgba(0,0,0,0.2)}
.toggle.on::after{transform:translateX(20px)}
.toggle-lg{width:74px;height:40px;background:#e9e9eb;border-radius:20px;position:relative;transition:background .3s;cursor:pointer}
.toggle-lg.on{background:#34c759}
.toggle-lg::after{content:'';width:34px;height:34px;background:#fff;border-radius:50%;position:absolute;top:3px;left:3px;transition:transform .3s;box-shadow:0 2px 4px rgba(0,0,0,0.2)}
.toggle-lg.on::after{transform:translateX(34px)}
.timer-btn{display:block;width:100%;padding:16px;background:#e9e9eb;color:#1c1c1e;border:none;border-radius:10px;font-size:16px;font-weight:600;cursor:pointer;margin:10px 0;transition:all .3s}
.timer-btn.active{background:#ff9500;color:#fff}
.btn{display:block;width:100%;padding:14px;background:#007aff;color:#fff;border:none;border-radius:10px;font-size:15px;font-weight:500;cursor:pointer;margin:10px 0}
.btn:active{background:#0056b3}
.btn-ghost{background:#f2f2f7;color:#007aff}
.info-row{display:flex;justify-content:space-between;padding:8px 0;font-size:13px}
.info-row .lbl{color:#8e8e93}
.hidden{display:none!important}
.settings-btn{cursor:pointer;-webkit-tap-highlight-color:transparent;transition:opacity .2s}
.settings-btn:active{opacity:0.6}
.modal{position:fixed;top:0;left:0;right:0;bottom:0;background:rgba(0,0,0,.4);display:flex;align-items:center;justify-content:center}
.modal-layer-1{z-index:200}
.modal-layer-2{z-index:210}
.settings-page{position:fixed;top:0;left:0;right:0;bottom:0;background:#f2f2f7;z-index:150;overflow-y:auto}
.modal-content{background:#fff;width:92%;max-width:380px;border-radius:14px;padding:20px;max-height:85vh;overflow-y:auto}
.modal-title{font-size:17px;font-weight:600;margin-bottom:16px}
.wifi-list{max-height:280px;overflow-y:auto}
.wifi-item{display:flex;justify-content:space-between;align-items:center;padding:14px 0;border-bottom:1px solid #e5e5ea;cursor:pointer}
.wifi-item:active{background:#f2f2f7}
.wifi-item .name{font-size:15px;font-weight:500}
.wifi-item .rssi{font-size:12px;color:#8e8e93}
.wifi-item .enc{color:#8e8e93;font-size:12px}
.input-field{width:100%;padding:12px;border:1px solid #e5e5ea;border-radius:10px;font-size:15px;margin:8px 0;outline:none}
.input-field:focus{border-color:#007aff}
.progress-bar{height:4px;background:#e5e5ea;border-radius:2px;overflow:hidden;margin:12px 0}
.progress-fill{height:100%;background:#007aff;width:0;transition:width .3s}
.bar-chart{display:flex;align-items:flex-end;justify-content:space-between;gap:6px;height:100px;padding:0 2px}
.bar-wrap{flex:1;display:flex;flex-direction:column;align-items:center;height:100%}
.bar{width:100%;background:linear-gradient(180deg,#30d158,#34c759);border-radius:4px 4px 0 0;min-height:2px;transition:height .6s ease}
.bar-today{background:linear-gradient(180deg,#0a84ff,#007aff)}
.bar-label{font-size:9px;color:#8e8e93;margin-top:4px;text-align:center;white-space:nowrap}
.bar-val{font-size:8px;color:#007aff;margin-bottom:2px;min-height:10px}
.loading-overlay{position:fixed;top:0;left:0;right:0;bottom:0;background:rgba(242,242,247,.85);z-index:9999;display:flex;flex-direction:column;align-items:center;justify-content:center;transition:opacity .3s;pointer-events:none}
.loading-overlay.hide{opacity:0;pointer-events:none}
.spinner{width:28px;height:28px;border:3px solid #e5e5ea;border-top-color:#007aff;border-radius:50%;animation:spin .8s linear infinite}
@keyframes spin{to{transform:rotate(360deg)}}
.loading-text{margin-top:12px;font-size:14px;color:#8e8e93}
@keyframes cardIn{from{opacity:0;transform:translateY(12px)}to{opacity:1;transform:translateY(0)}}
.drag-handle{cursor:grab;touch-action:none;-webkit-user-select:none;user-select:none;padding:8px;color:#c7c7cc;font-size:20px;line-height:1}
.drag-handle:active{cursor:grabbing}
.sort-item{display:flex;align-items:center;background:#f2f2f7;border-radius:12px;padding:12px 16px;margin-bottom:8px;transition:transform .2s,box-shadow .2s;touch-action:none}
.sort-item.dragging{transform:scale(1.03);box-shadow:0 8px 24px rgba(0,0,0,0.12);background:#fff;z-index:10}
.sort-item .sort-name{flex:1;font-size:15px;font-weight:500}
.sort-item .sort-icon{font-size:18px;color:#007aff}
.sort-toggle{width:42px;height:26px;background:#e9e9eb;border-radius:13px;position:relative;transition:background .3s;cursor:pointer;flex-shrink:0}
.sort-toggle.on{background:#34c759}
.sort-toggle::after{content:'';width:22px;height:22px;background:#fff;border-radius:50%;position:absolute;top:2px;left:2px;transition:transform .3s;box-shadow:0 1px 3px rgba(0,0,0,.15)}
.sort-toggle.on::after{transform:translateX(16px)}
.time-picker{display:flex;align-items:center;justify-content:center;height:180px;position:relative;background:#fff;border-radius:12px;margin-bottom:12px;overflow:hidden}
.time-picker-column{flex:1;height:100%;position:relative;overflow-y:scroll;-webkit-overflow-scrolling:touch;scroll-snap-type:y mandatory;text-align:center}
.time-picker-column::-webkit-scrollbar{display:none}
.time-picker-items{padding:72px 0}
.time-picker-item{height:36px;line-height:36px;font-size:20px;color:#1c1c1e;scroll-snap-align:center;transition:opacity .15s,color .15s;opacity:.2}
.time-picker-item.active{opacity:1;font-weight:600}
.time-picker-separator{font-size:17px;color:#8e8e93;padding:0 8px;position:relative;z-index:2}
</style>
</head>
<body>
<div class="loading-overlay" id="loadingOverlay">
<div class="spinner"></div>
<div class="loading-text">加载中...</div>
</div>
<div class="header">
  <h1>智能插排</h1>
  <span id="chipTime" style="font-size:13px;color:#8e8e93">--:--</span>
</div>

<div id='cardTemplates' style='display:none;'>
 
<div class="card" data-card="relay">
<div class="card-title">继电器控制</div>
<div style="display:flex;gap:16px;justify-content:center;padding:8px 0">
<div class="switch-row" style="flex-direction:column;align-items:center;border:none;padding:12px 16px;background:#f2f2f7;border-radius:14px;flex:1">
<span style="font-size:14px;font-weight:500">从继电器</span>
<span style="font-size:11px;color:#8e8e93;margin:4px 0 10px">可控端</span>
<div class="toggle-lg" id="rs"></div>
</div>
<div class="switch-row" style="flex-direction:column;align-items:center;border:none;padding:12px 16px;background:#f2f2f7;border-radius:14px;flex:1">
<span style="font-size:14px;font-weight:500">主继电器</span>
<span style="font-size:11px;color:#8e8e93;margin:4px 0 10px">常通端</span>
<div class="toggle-lg" id="rm"></div>
</div>
</div>
<div class="switch-row" style="border-top:1px solid #e5e5ea;margin-top:12px;padding-top:12px">
<span style="font-size:15px">锁定模式<span style="font-size:11px;color:#8e8e93;display:block;margin-top:2px">禁用物理按键，仅 Web 端控制</span></span>
<div class="toggle" id="lk"></div>
</div>
<div class="switch-row">
<span style="font-size:15px">拔除断电<span style="font-size:11px;color:#8e8e93;display:block;margin-top:2px">功率低于阈值自动关闭</span></span>
<div class="toggle" id="pwrOffHome" onclick="togglePowerOffHome()"></div>
</div>
</div>

