S0DX/esp8266-powerstrip/src/web_config.cpp
<div class="card" data-card="wifidetect">
<div class="card-title">人来上电</div>
<p style="font-size:12px;color:#8e8e93;margin:0 0 12px">检测指定WiFi信号自动开启继电器</p>
<div class="info-row"><span class="lbl">启用检测</span><div class="toggle" id="wifiDetectToggle" onclick="toggleWifiDetect()"></div></div>
<div class="info-row" style="margin-top:12px"><span class="lbl">检测目标</span><span id="wifiDetectTarget" style="color:#007aff;font-weight:600">等待记录</span></div>
<div id="wifiDetectMacRow" class="info-row" style="display:none"><span class="lbl">MAC 地址</span><span id="wifiDetectMacVal" style="color:#8e8e93;font-size:12px">--</span></div>
<button class="btn" style="width:100%;margin-top:8px" onclick="showWiFiSelect()">选择WiFi</button>
<div class="info-row" style="margin-top:8px"><span class="lbl">状态</span><span id="wifiDetectStatus" style="color:#34c759;font-weight:600">--</span></div>
<button class="btn btn-ghost" style="width:100%;margin-top:12px" onclick="showWifiDetectMore()">更多配置</button>
</div>

<div class="card" data-card="power">
<div class="card-title" style="display:flex;justify-content:space-between;align-items:center">实时电量<div class="toggle" id="mt"></div></div>
<div class="grid" style="margin-bottom:12px">
<div class="grid-item"><div class="val" id="mV">--</div><div class="lbl">电压(V)</div></div>
<div class="grid-item"><div class="val" id="mI">--</div><div class="lbl">电流(A)</div></div>
</div>
<div class="grid">
<div class="grid-item"><div class="val" id="mP">--</div><div class="lbl">功率(W)</div></div>
<div class="grid-item"><div class="val" id="mE">--</div><div class="lbl">用电量(kWh)</div></div>
</div>
<button class="btn" onclick="showMeterMore()" style="margin-top:10px">更多配置</button>
</div>

<div class="card" data-card="history">
<div class="card-title">用电历史 <span style="font-size:10px;color:#c7c7cc;font-weight:400">过去 7 天</span></div>
<div class="bar-chart" id="histChart" style="margin:8px 0 0">
<div class="bar-wrap"><div class="bar-val" id="hv0"></div><div class="bar" id="hb0" style="height:2px"></div><div class="bar-label" id="hl0">-</div></div>
<div class="bar-wrap"><div class="bar-val" id="hv1"></div><div class="bar" id="hb1" style="height:2px"></div><div class="bar-label" id="hl1">-</div></div>
<div class="bar-wrap"><div class="bar-val" id="hv2"></div><div class="bar" id="hb2" style="height:2px"></div><div class="bar-label" id="hl2">-</div></div>
<div class="bar-wrap"><div class="bar-val" id="hv3"></div><div class="bar" id="hb3" style="height:2px"></div><div class="bar-label" id="hl3">-</div></div>
<div class="bar-wrap"><div class="bar-val" id="hv4"></div><div class="bar" id="hb4" style="height:2px"></div><div class="bar-label" id="hl4">-</div></div>
<div class="bar-wrap"><div class="bar-val" id="hv5"></div><div class="bar" id="hb5" style="height:2px"></div><div class="bar-label" id="hl5">-</div></div>
<div class="bar-wrap"><div class="bar-val" id="hv6" style="color:#007aff;font-weight:600"></div><div class="bar bar-today" id="hb6" style="height:2px"></div><div class="bar-label" id="hl6" style="color:#007aff;font-weight:600">今天</div></div>
</div>
<div style="display:flex;justify-content:space-between;margin-top:10px;font-size:11px;color:#8e8e93"><span>单位: kWh</span><span id="histTotal">合计: --</span></div>
</div>

<div class="card" data-card="wifi">
<div class="card-title">WiFi 状态</div>
<div class="info-row"><span class="lbl">连接状态</span><span id="ws">--</span></div>
<div class="info-row"><span class="lbl">信号强度</span><span id="wr">--</span></div>
<div class="info-row"><span class="lbl">已连接SSID</span><span id="wssid">--</span></div>
<div class="info-row"><span class="lbl">设备IP</span><span id="otaip">--</span></div>
<div class="info-row"><span class="lbl">WiFi断开红灯告警</span><div class="toggle" id="redLedToggle" onclick="toggleRedLed()"></div></div>
<button class="btn btn-ghost" id="wifiBtn">连接 WiFi</button>
</div>

<div class="card" data-card="quicktimer">
<div class="card-title">快速倒计时</div>
<div style="padding:8px 0">
<div class="time-picker" id="quickTimerPicker">
  <div class="time-picker-column" id="hourCol"><div class="time-picker-items" id="hourItems"></div></div>
  <div class="time-picker-separator">时</div>
  <div class="time-picker-column" id="minuteCol"><div class="time-picker-items" id="minuteItems"></div></div>
  <div class="time-picker-separator">分</div>
</div>
<button class="timer-btn" id="qtm" onclick="toggleQuickTimer()">启动倒计时</button>
</div>
</div>
 
</div>

<div id='cardsContainer'></div>

<div class="card">
<div class="card-title">设备信息</div>
<div class="info-row"><span class="lbl">版本</span><span id="ver">V</span></div>
<div class="info-row"><span class="lbl">运行时间</span><span id="up">--</span></div>
<div class="info-row"><span class="lbl">上次复位</span><span id="rst" style="font-size:12px;color:#8e8e93">--</span></div>
<div class="info-row" style="margin-bottom:10px">
  <span class="lbl">系统日志</span>
  <div class="toggle" id="sysLogToggle" onclick="toggleSysLog()"></div>
</div>
<div id="sysLogContainer" class="info-row" style="align-items:flex-start;flex-direction:column;margin-top:4px"><span class="lbl" style="margin-bottom:4px">系统日志</span><pre id="sysLog" style="width:100%;background:#f2f2f7;border-radius:8px;padding:8px;font-size:11px;max-height:180px;overflow-y:auto;white-space:pre-wrap;word-break:break-all;color:#333;line-height:1.4;margin:0">--</pre></div>
<div id="crashLogContainer" class="info-row" style="align-items:flex-start;flex-direction:column;margin-top:4px"><span class="lbl" style="margin-bottom:4px">崩溃前日志</span><pre id="crashLog" style="width:100%;background:#fff2f0;border:1px solid #ffccc7;border-radius:10px;padding:12px;font-size:12px;max-height:360px;min-height:120px;overflow-y:auto;white-space:pre-wrap;word-break:break-all;color:#c00;line-height:1.5;margin:0">--</pre></div>
<button class="btn btn-ghost" style="margin-top:12px;width:100%" onclick="showMoreSettings()">更多设置</button>
</div>


<div id="wifiM" class="modal modal-layer-1" style="display:none">
<div class="modal-content">
<div class="modal-title">连接 WiFi</div>
<div id="wifiSucc" class="hidden" style="background:#34c759;color:#fff;padding:14px;border-radius:10px;margin-bottom:12px;text-align:center">
<div style="font-size:15px;font-weight:600">连接成功！</div>
<div style="font-size:12px;margin-top:6px">WiFi: <span id="connSSID"></span></div>
</div>
<div id="wifiSelInfo" style="background:#007aff;color:#fff;padding:12px 14px;border-radius:10px;margin-bottom:12px;display:none">
<div style="font-size:13px;font-weight:500">将要连接: <span id="selWifiName" style="font-weight:600"></span></div>
</div>
<input type="text" id="pwd" class="input-field" placeholder="输入密码" style="display:none;margin-bottom:12px">
<button class="btn" id="connBtn" style="display:none;margin-bottom:12px" onclick="conn(selSSID, document.getElementById('pwd').value)">确定连接</button>
<div id="wl" class="wifi-list"></div>
<button class="btn btn-ghost" id="scanBtn">扫描</button>
<button class="btn btn-ghost" id="closeWifiBtn">关闭</button>
</div>
</div>

<div id="wifiSelM" class="modal modal-layer-1" style="display:none">
<div class="modal-content">
<div class="modal-title">选择人来上电目标WiFi</div>
<div id="wifiSelSucc" class="hidden" style="background:#34c759;color:#fff;padding:14px;border-radius:10px;margin-bottom:12px;text-align:center">
<div style="font-size:15px;font-weight:600">已选择！</div>
<div style="font-size:12px;margin-top:6px">目标: <span id="selSSID"></span></div>
</div>
<div id="wsl" class="wifi-list"></div>
<button class="btn btn-ghost" id="scanSelBtn">扫描</button>
<button class="btn btn-ghost" id="closeWifiSelBtn">关闭</button>
</div>
</div>

