S0DX/esp8266-powerstrip/src/web_config.cpp
<div id="wifiSettingsM" class="modal modal-layer-2" style="display:none">
<div class="modal-content">
<div class="modal-title">人来上电检测设置</div>
<div class="info-row" style="margin-top:8px">
  <span class="lbl">检测距离(RSSI阈值)</span>
  <span id="wifiSettingsRssiVal" style="color:#007aff;font-weight:600">-70 dBm</span>
</div>
<div style="display:flex;align-items:center;gap:8px;margin-top:4px;margin-bottom:16px">
  <input type="range" id="wifiSettingsRssi" min="-90" max="-30" value="-70" style="flex:1" oninput="document.getElementById('wifiSettingsRssiVal').textContent=this.value+' dBm'">
</div>
<div class="info-row">
  <span class="lbl">扫描频率</span>
  <select id="wifiSettingsScanSpeed" style="padding:6px 10px;border:1px solid #e5e5ea;border-radius:8px;font-size:13px;background:#fff;width:100%">
    <option value="0">慢 (30秒)</option>
    <option value="1" selected>中 (15秒)</option>
    <option value="2">快 (5秒)</option>
    <option value="3">自动学习</option>
  </select>
</div>
<p style="font-size:11px;color:#8e8e93;margin:4px 0 0">自动学习模式根据历史数据动态调整扫描频率</p>
<div id="wifiAutoStatus" class="info-row" style="margin-top:12px;display:none">
  <span class="lbl">学习状态</span>
  <span id="wifiAutoStatusVal" style="color:#8e8e93;font-size:12px">--</span>
</div>
<div style="display:flex;gap:8px;margin-top:16px">
  <button class="btn" style="flex:1" onclick="saveWifiDetectSettings()">保存</button>
  <button class="btn btn-ghost" style="flex:1" onclick="closeWifiDetectSettings()">取消</button>
</div>
</div>
</div>

<div id="wifiDetectMoreM" class="modal modal-layer-1" style="display:none">
<div class="modal-content">
<div class="modal-title">更多配置</div>
<div class="info-row" style="margin-top:12px"><span class="lbl">按键检测</span><div class="toggle" id="buttonDetectToggle" onclick="toggleButtonDetect()"></div></div>
<p style="font-size:11px;color:#8e8e93;margin:4px 0 8px">锁定模式下按物理按钮触发单次WiFi扫描</p>
<div class="info-row" style="margin-top:12px"><span class="lbl">联锁倒计时</span><div class="toggle" id="wifiDetectLinkToggle" onclick="toggleWifiDetectLink()"></div></div>
<p style="font-size:11px;color:#8e8e93;margin:4px 0 8px">WiFi消失时自动启动关闭倒计时</p>
<div class="info-row" style="margin-top:12px"><span class="lbl">仅开主继电器</span><div class="toggle" id="wdOnlyMaster" onclick="toggleWifiDetectOnlyMaster()"></div></div>
<p style="font-size:11px;color:#8e8e93;margin:4px 0 8px">开启后人来上电只打开主继电器</p>
<div class="info-row settings-btn" style="margin-top:12px" onclick="showWifiDetectSettings()">
<span class="lbl">检测设置</span><span id="wifiDetectSettingsVal" style="color:#007aff;font-weight:500;font-size:13px">--</span><span style="color:#007aff;margin-left:4px;font-size:10px">&#9654;</span></div>
<button class="btn btn-ghost" style="width:100%;margin-top:16px" onclick="closeWifiDetectMore()">关闭</button>
</div>
</div>

<div id="meterMoreM" class="modal modal-layer-1" style="display:none">
<div class="modal-content">
<div class="modal-title">电表更多配置</div>
<p style="font-size:11px;color:#8e8e93;margin:4px 0 12px">校准前请确保万用表已就位，校准期间设备会阻塞 1-2 秒</p>
<div style="margin-bottom:12px">
<div style="font-size:13px;color:#8e8e93;margin-bottom:6px">电压校准（实测 V）</div>
<div style="display:flex;gap:8px;align-items:center">
<input type="number" id="calibV" class="input-field" placeholder="220.0" step="0.1" min="1" max="300" style="flex:1;width:auto;margin:0">
<button class="btn" style="width:auto;flex:0 0 80px;margin:0" onclick="doCalibV()">校准</button>
</div>
</div>
<div style="margin-bottom:12px">
<div style="font-size:13px;color:#8e8e93;margin-bottom:6px">电流校准（实测 A）</div>
<div style="display:flex;gap:8px;align-items:center">
<input type="number" id="calibI" class="input-field" placeholder="4.545" step="0.001" min="0.001" max="100" style="flex:1;width:auto;margin:0">
<button class="btn" style="width:auto;flex:0 0 80px;margin:0" onclick="doCalibI()">校准</button>
</div>
</div>
<div style="border-top:1px solid #e5e5ea;margin:12px 0;padding-top:12px">
<button class="btn btn-ghost" style="width:100%;margin:0 0 8px 0" onclick="doResetCalib()">恢复出厂校准</button>
<button class="btn btn-ghost" style="width:100%;margin:0 0 8px 0" onclick="doSaveCalib()">保存校准到 Flash</button>
<button class="btn btn-ghost" style="width:100%;margin:0" onclick="doClearEnergy()">清零电能计数器</button>
</div>
<button class="btn btn-ghost" style="width:100%;margin:8px 0 0 0" onclick="closeMeterMore()">关闭</button>
</div>
</div>

<div id="otaM" class="modal modal-layer-1" style="display:none">
<div class="modal-content">
<div class="modal-title">固件升级</div>
<div id="opg" class="hidden">
<div class="progress-bar"><div class="progress-fill" id="opf"></div></div>
<p style="text-align:center;font-size:13px;color:#8e8e93" id="ost">上传中...</p>
</div>
<div id="ofm">
<p style="font-size:13px;color:#8e8e93;margin-bottom:12px">选择 .bin 文件进行升级</p>
<input type="file" id="of" accept=".bin" style="margin:10px 0">
<input type="password" id="op" class="input-field" placeholder="输入升级密码">
<button class="btn" id="doOtaBtn">开始升级</button>
</div>
<button class="btn btn-ghost" id="closeOtaBtn">关闭</button>
</div>
</div>

<div id="moreSettingsM" class="settings-page" style="display:none">
<div style="min-height:100vh;padding:16px;padding-bottom:80px">
<div style="display:flex;justify-content:space-between;align-items:center;margin-bottom:16px">
<h1 style="font-size:22px;margin:0">更多设置</h1>
<button class="btn btn-ghost" style="width:auto;padding:8px 16px" onclick="closeMoreSettings()">关闭</button>
</div>

<div class="card">
<div class="card-title">主页卡片排序</div>
<p style="font-size:12px;color:#8e8e93;margin:0 0 12px">拖动调整卡片显示顺序</p>
<div id="sortList"></div>
</div>

<div class="card">
<div class="card-title">拔除断电设置</div>
<div style="display:flex;align-items:center;gap:12px;padding:8px 0">
  <span style="font-size:14px">功率阈值:</span>
  <input type="number" id="pwrThresh" class="input-field" style="width:80px;margin:0;padding:8px" step="0.1" min="0.1" max="1" value="0.5">
  <span style="font-size:14px">W</span>
  <button class="timer-btn" style="width:auto;margin:0;padding:0 12px;height:32px;font-size:13px" onclick="savePowerOff()">保存</button>
</div>
</div>

<div class="card">
<div class="card-title">倒计时关闭</div>
<div style="padding:8px 0">
<div class="info-row" style="margin-bottom:10px"><span class="lbl">物理按钮自动倒计时</span><div class="toggle" id="buttonAutoTimerToggle" onclick="toggleButtonAutoTimer()"></div></div>
<p style="font-size:11px;color:#8e8e93;margin:4px 0 0">开启后按物理按钮自动启动倒计时关闭</p>
</div>
</div>

<div class="card">
<div class="card-title">24 小时时间段循环</div>
<p style="font-size:13px;color:#8e8e93;margin-bottom:12px">设定设备在此区间内自动保持开启 (依赖 NTP 联网)</p>
<div id="cyclePeriodsList"></div>
<div id="cycleAddRow" style="display:flex;gap:12px;margin-bottom:12px">
  <div style="flex:1">
    <div class="lbl" style="margin-bottom:4px">开启时间</div>
    <input type="time" id="cStartTime" class="input-field" style="margin:0;padding:8px">
  </div>
  <div style="flex:1">
    <div class="lbl" style="margin-bottom:4px">结束时间</div>
    <input type="time" id="cEndTime" class="input-field" style="margin:0;padding:8px">
  </div>
</div>
<div style="display:flex;gap:8px;margin-bottom:12px">
  <button class="timer-btn" style="flex:1" onclick="addCyclePeriod()">添加时段</button>
</div>
<div class="info-row" style="margin-bottom:12px">
  <span class="lbl">启用循环</span>
  <div class="toggle" id="cycleToggle" onclick="toggleCycle()"></div>
</div>
</div>

<div class="card">
<div class="card-title">MQTT 代理平台</div>
<div class="info-row" style="margin-bottom:12px">
  <span class="lbl">启用 MQTT</span>
  <div class="toggle" id="mqttToggle" onclick="toggleMqtt()"></div>
</div>
<input type="text" id="mqServer" class="input-field" placeholder="服务器地址 (IP 或域名)" maxlength="32">
<input type="number" id="mqPort" class="input-field" placeholder="端口号 (默认 1883)">
<input type="text" id="mqUser" class="input-field" placeholder="用户名 (选填)" maxlength="20">
<input type="password" id="mqPass" class="input-field" placeholder="密码 (选填)" maxlength="20">
<button class="btn" style="margin-top:12px" onclick="saveMqtt()">保存 MQTT 设置</button>
</div>

<div class="card">
<div class="card-title">功耗优化</div>
<div class="info-row" style="margin-bottom:10px">
  <span class="lbl">STA 连接后自动关闭 AP</span>
  <div class="toggle" id="autoCloseAPToggle" onclick="toggleAutoCloseAP()"></div>
</div>
<p style="font-size:11px;color:#8e8e93;margin:4px 0 0">开启后 STA 连接 5 分钟自动关闭 AP，STA 断开时自动恢复。默认关闭，关闭前可通过 AP 访问此开关。</p>
<div class="info-row" style="margin-top:12px;margin-bottom:10px">
  <span class="lbl">限制 WiFi 发射功率</span>
  <div class="toggle" id="wifiTxPowerToggle" onclick="toggleWiFiTxPower()"></div>
</div>
<p style="font-size:11px;color:#8e8e93;margin:4px 0 0">开启后将弱信号下的最大发射功率从 14dBm 降到 10dBm，可降低峰值电流与功耗，可能改善继电器异响。</p>
</div>

<div class="card">
<div class="card-title">计费供电</div>
<p style="font-size:12px;color:#8e8e93;margin:0 0 12px">启用后立即供电并按设定条件自动关闭（与拔除断电互斥）</p>
<div class="info-row">
  <span class="lbl">启用计费供电</span>
  <div class="toggle" id="billingToggle" onclick="toggleBilling()"></div>
</div>
<div style="display:flex;align-items:center;gap:12px;padding:8px 0">
  <span style="font-size:14px">阈值类型:</span>
  <select id="billingMode" class="input-field" style="width:100px;margin:0;padding:8px" onchange="onBillingModeChange()">
    <option value="0">用电量</option>
    <option value="1">金额</option>
    <option value="2">时长</option>
  </select>
</div>
<div id="billingEnergyRow" style="display:flex;align-items:center;gap:12px;padding:8px 0">
  <span style="font-size:14px">用电量阈值:</span>
  <input type="number" id="billingThresh" class="input-field" style="width:80px;margin:0;padding:8px" step="0.01" min="0.01" max="50" value="10">
  <span style="font-size:14px">度</span>
  <button class="timer-btn" style="width:auto;margin:0 0 0 auto;padding:0 12px;height:32px;font-size:13px" onclick="saveBilling()">保存</button>
</div>
<div id="billingMoneyRow" style="display:none;align-items:center;gap:12px;padding:8px 0">
  <span style="font-size:14px">金额阈值:</span>
  <input type="number" id="billingMoney" class="input-field" style="width:80px;margin:0;padding:8px" step="0.01" min="0.01" max="655" value="5">
  <span style="font-size:14px">元</span>
  <button class="timer-btn" style="width:auto;margin:0 0 0 auto;padding:0 12px;height:32px;font-size:13px" onclick="saveBilling()">保存</button>
</div>
<div id="billingTimeRow" style="display:none;align-items:center;gap:12px;padding:8px 0">
  <span style="font-size:14px">时长阈值:</span>
  <input type="number" id="billingTime" class="input-field" style="width:80px;margin:0;padding:8px" step="1" min="1" max="65535" value="60">
  <span style="font-size:14px">分钟</span>
  <button class="timer-btn" style="width:auto;margin:0 0 0 auto;padding:0 12px;height:32px;font-size:13px" onclick="saveBilling()">保存</button>
</div>
<div class="info-row" style="margin-top:8px">
  <span class="lbl">已用电量</span>
  <span id="billingUsed" style="color:#007aff;font-weight:600">--</span>
</div>
<div class="info-row" style="margin-top:8px">
  <span class="lbl">已用金额</span>
  <span id="billingUsedMoney" style="color:#ff9500;font-weight:600">--</span>
</div>
<div class="info-row" style="margin-top:8px">
  <span class="lbl">已用时长</span>
  <span id="billingUsedTime" style="color:#34c759;font-weight:600">--</span>
</div>
</div>

<div class="card">
<div class="card-title">电费计算</div>
<div style="display:flex;align-items:center;gap:12px;padding:8px 0">
  <span style="font-size:14px">电价:</span>
  <input type="number" id="energyPrice" class="input-field" style="width:80px;margin:0;padding:8px" step="0.01" min="0.1" max="2" value="0.6">
  <span style="font-size:14px">元/度</span>
  <button class="timer-btn" style="width:auto;margin:0;padding:0 12px;height:32px;font-size:13px" onclick="savePrice()">保存</button>
</div>
<div class="info-row" style="margin-top:8px">
  <span class="lbl">当前电费</span>
  <span id="currentCost" style="color:#ff9500;font-weight:600">--</span>
</div>
<div class="info-row" style="margin-top:8px">
  <span class="lbl">本月用电</span>
  <span id="monthEnergy" style="color:#34c759;font-weight:600">--</span>
</div>
<div class="info-row" style="margin-top:8px">
  <span class="lbl">上月用电</span>
  <span id="lastMonthEnergy" style="color:#8e8e93;font-weight:600">--</span>
</div>
<div style="margin-top:12px;padding-top:12px;border-top:1px solid #e5e5ea">
  <button class="timer-btn" style="width:100%;background:#ff3b30;color:#fff" onclick="resetEnergyHistory()">清零历史电量和电费记录</button>
</div>
</div>

<div class="card">
<div class="card-title">系统设置</div>
<div style="margin-top:4px">
  <div class="lbl" style="margin-bottom:8px">AP 热点密码</div>
  <div style="display:flex;gap:8px">
    <input type="password" id="apPass" style="flex:1;padding:10px;border:1px solid #e5e5ea;border-radius:8px;font-size:14px" placeholder="设置八位以上密码">
    <button class="timer-btn" style="width:auto;margin:0;padding:0 16px;height:38px" onclick="saveApPass()">保存</button>
  </div>
  <div class="lbl" style="margin-top:12px;margin-bottom:8px">AP 名称后缀</div>
  <div style="display:flex;gap:8px">
    <input type="number" id="apSuffix" class="input-field" style="flex:1;padding:10px;border:1px solid #e5e5ea;border-radius:8px;font-size:14px;margin:0" step="1" min="0" max="255" value="0" placeholder="编号">
    <button class="timer-btn" style="width:auto;margin:0;padding:0 16px;height:38px" onclick="saveApSuffix()">保存</button>
  </div>
  <p style="font-size:11px;color:#8e8e93;margin:4px 0 0">AP 名称为 PowerStrip-XXX，0=无后缀</p>
  <div class="lbl" style="margin-top:12px;margin-bottom:8px">局域网域名</div>
  <div style="display:flex;gap:8px">
    <input type="text" id="hostname" style="flex:1;padding:10px;border:1px solid #e5e5ea;border-radius:8px;font-size:14px" maxlength="10" placeholder="power" oninput="validateHostname(this)">
    <button class="timer-btn" style="width:auto;margin:0;padding:0 16px;height:38px" onclick="saveHostname()">保存</button>
  </div>
  <p id="hostnameHint" style="font-size:11px;color:#8e8e93;margin:4px 0 0">访问地址为 <span id="hostnamePreview">power.local</span>，1-10 位小写字母/数字/连字符</p>
  <div style="display:flex;gap:8px;margin-top:12px">
    <button class="btn" id="otaBtn">固件升级</button>
    <button class="btn btn-ghost" id="restartBtn" onclick="confirmRestart()">重启设备</button>
  </div>
  <button class="btn btn-ghost" id="resetBtn" onclick="confirmReset()" style="margin-top:10px;width:100%">恢复出厂</button>
</div>
</div>

