S0DX/esp8266-powerstrip/src/web_config.cpp
</div>
</div>

<script>
var selSSID='';

function init(){
  try{
    renderCards(cardOrder);
    
    var scanBtn=document.getElementById('scanBtn');
    if(scanBtn)scanBtn.addEventListener('click',doScan);

    var closeWifiBtn=document.getElementById('closeWifiBtn');
    if(closeWifiBtn)closeWifiBtn.addEventListener('click',closeWifi);

    var scanSelBtn=document.getElementById('scanSelBtn');
    if(scanSelBtn)scanSelBtn.addEventListener('click',doScanSelect);

    var closeWifiSelBtn=document.getElementById('closeWifiSelBtn');
    if(closeWifiSelBtn)closeWifiSelBtn.addEventListener('click',closeWifiSelect);
    
    var otaBtn=document.getElementById('otaBtn');
    if(otaBtn)otaBtn.addEventListener('click',showOta);
    
    var doOtaBtn=document.getElementById('doOtaBtn');
    if(doOtaBtn)doOtaBtn.addEventListener('click',doOta);
    
    var closeOtaBtn=document.getElementById('closeOtaBtn');
    if(closeOtaBtn)closeOtaBtn.addEventListener('click',closeOta);
    
    var resetBtn=document.getElementById('resetBtn');
    if(resetBtn)resetBtn.addEventListener('click',doReset);
    
    var moreSettingsBtn=document.querySelector('button[onclick="showMoreSettings()"]');
    if(moreSettingsBtn)moreSettingsBtn.addEventListener('click',showMoreSettings);
    
    var closeMoreBtn=document.querySelector('button[onclick="closeMoreSettings()"]');
    if(closeMoreBtn)closeMoreBtn.addEventListener('click',closeMoreSettings);
    loadCardOrder(0);
    fetch('/api/time?ts='+Math.floor(Date.now()/1000));
  }catch(e){
    console.error('Error initializing buttons:',e);
  }
}

function showMoreSettings(){
  document.getElementById('moreSettingsM').style.display='block';
  renderSortList(cardOrder);
}

function closeMoreSettings(){
  document.getElementById('moreSettingsM').style.display='none';
}

// 显示模态框
function showModal(title,content){
  var modalHtml='<div class="modal" id="tempModal" onclick="if(event.target===this){closeModal(\'tempModal\');}">';
  modalHtml+='<div class="modal-content">';
  modalHtml+='<div class="modal-title">'+title+'</div>';
  modalHtml+=content;
  modalHtml+='</div></div>';
  
  var tempDiv=document.createElement('div');
  tempDiv.innerHTML=modalHtml;
  document.body.appendChild(tempDiv.firstChild);
}

function closeModal(id){
  var m=document.getElementById(id);
  if(m)m.remove();
}

function update(){
  fetch('/api/status').then(function(r){return r.json()}).then(function(d){
    try{
    if(d.cv !== undefined && d.cv !== cardVisibility){
      cardVisibility=d.cv;
      renderCards(cardOrder);
    }
    var ws=document.getElementById('ws');
    if(ws){
      if(d.conn){
        ws.textContent='已连接';
        ws.style.color='#34c759';
      }else{
        ws.textContent='未连接';
        ws.style.color='#ff3b30';
      }
    }
    var wr=document.getElementById('wr');
    if(wr){
      if(d.conn && d.rssi > -999){
        var rssi=d.rssi;
        var color='#34c759';
        if(rssi < -70) color='#ff9500';
        if(rssi < -85) color='#ff3b30';
        wr.innerHTML='<span style="color:'+color+'">'+rssi+' dBm</span>';
      }else{
        wr.textContent='--';
      }
    }
    var wssid=document.getElementById('wssid');
    if(wssid) wssid.textContent=(d.conn && d.ssid)?d.ssid:'--';
    var otaip=document.getElementById('otaip');
    if(otaip) otaip.textContent=(d.conn && d.ip)?d.ip:'--';
    var up=document.getElementById('up'); if(up) up.textContent=fmt(d.up);
    var rst=document.getElementById('rst'); if(rst) rst.textContent=d.rst||'--';
    var ver=document.getElementById('ver'); if(ver) ver.textContent='V'+d.ver;
    var rm=document.getElementById('rm'); if(rm){if(d.m)rm.classList.add('on');else rm.classList.remove('on');}
    var rs=document.getElementById('rs'); if(rs){if(d.s)rs.classList.add('on');else rs.classList.remove('on');}
    var lk=document.getElementById('lk'); if(lk){if(d.lk)lk.classList.add('on');else lk.classList.remove('on');}
    var mV=document.getElementById('mV'); if(mV) mV.textContent=d.me?(d.v!==undefined?d.v:'--'):'--';
    var mI=document.getElementById('mI'); if(mI) mI.textContent=d.me?(d.i!==undefined?d.i:'--'):'--';
    var mP=document.getElementById('mP'); if(mP) mP.textContent=d.me?(d.p!==undefined?d.p:'--'):'--';
    var mE=document.getElementById('mE'); if(mE) mE.textContent=d.me?(d.e!==undefined?(d.e/1000).toFixed(2):'--'):'--';
    var mt=document.getElementById('mt'); if(mt){if(d.me)mt.classList.add('on');else mt.classList.remove('on');}
    // 快速倒计时卡片：iOS 风格滚动选择器（小时 + 分钟）
    initQuickTimerPicker();
    // 定时器运行中时强制同步到当前设定值；非运行状态不覆盖用户正在滑动的选择
    var timerRunning=(d.te && d.tr>0);
    if(timerRunning){
      setQuickTimerPickerValue(d.td,true);
      qPickerUserSet=false;
    }else if(!qPickerUserSet && d.td && d.td>0 && d.td<=1440){
      setQuickTimerPickerValue(d.td,false);
    }
    var batEl=document.getElementById('buttonAutoTimerToggle'); if(batEl){if(d.bat)batEl.classList.add('on');else batEl.classList.remove('on');}
    
    var rlt=document.getElementById('redLedToggle');
    if(rlt){if(d.rl)rlt.classList.add('on');else rlt.classList.remove('on');}
    
    if(d.ap !== undefined && document.activeElement !== document.getElementById('apPass')) document.getElementById('apPass').value=d.ap;
    if(d.aps !== undefined && document.activeElement !== document.getElementById('apSuffix')) document.getElementById('apSuffix').value=d.aps;
    if(d.host !== undefined && document.activeElement !== document.getElementById('hostname')) {
      document.getElementById('hostname').value=d.host;
      document.getElementById('hostnamePreview').textContent=d.host+'.local';
    }
    if(d.mqs !== undefined && document.activeElement !== document.getElementById('mqServer')) document.getElementById('mqServer').value=d.mqs;
    if(d.mqp !== undefined && document.activeElement !== document.getElementById('mqPort')) document.getElementById('mqPort').value=d.mqp;
    if(d.mqu !== undefined && document.activeElement !== document.getElementById('mqUser')) document.getElementById('mqUser').value=d.mqu;
    if(d.mqpw !== undefined && document.activeElement !== document.getElementById('mqPass')) document.getElementById('mqPass').value=d.mqpw;
    if(d.sh !== undefined && document.activeElement !== document.getElementById('cStartTime')) {
      document.getElementById('cStartTime').value = (d.sh<10?'0':'')+d.sh+':'+(d.sm<10?'0':'')+d.sm;
    }
    if(d.eh !== undefined && document.activeElement !== document.getElementById('cEndTime')) {
      document.getElementById('cEndTime').value = (d.eh<10?'0':'')+d.eh+':'+(d.em<10?'0':'')+d.em;
    }

    var ct=document.getElementById('cycleToggle');
    if(ct){if(d.ce)ct.classList.add('on');else ct.classList.remove('on');}
    renderCyclePeriods(d.cp);
    var addRow=document.getElementById('cycleAddRow');
    if(addRow)addRow.style.display=(d.cpc>=3)?'none':'flex';
    var mtog=document.getElementById('mqttToggle');
    if(mtog){if(d.mqe)mtog.classList.add('on');else mtog.classList.remove('on');}

