S0DX/esp8266-powerstrip/src/web_config.cpp
    var acap=document.getElementById('autoCloseAPToggle');
    if(acap){if(d.acap)acap.classList.add('on');else acap.classList.remove('on');}
    var wtpl=document.getElementById('wifiTxPowerToggle');
    if(wtpl){if(d.wtpl)wtpl.classList.add('on');else wtpl.classList.remove('on');}

    var slog=document.getElementById('sysLogToggle');
    if(slog){if(d.syslog)slog.classList.add('on');else slog.classList.remove('on');}
    var slc=document.getElementById('sysLogContainer');
    var clc=document.getElementById('crashLogContainer');
    if(slc)slc.style.display=d.syslog?'flex':'none';
    if(clc)clc.style.display=d.syslog?'flex':'none';

    var pt=document.getElementById('pwrOffToggle');
    if(pt){if(d.pe)pt.classList.add('on');else pt.classList.remove('on');}
    syncPowerOffHome(d.pe);
    var pth=document.getElementById('pwrThresh');
    if(pth && d.pt !== undefined && document.activeElement !== pth) pth.value=d.pt;

    // 更新计费供电状态
    var bt=document.getElementById('billingToggle');
    if(bt){if(d.be)bt.classList.add('on');else bt.classList.remove('on');}
    var bmo=document.getElementById('billingMode');
    if(bmo && d.bmo !== undefined && document.activeElement !== bmo){
      bmo.value=d.bmo;
      onBillingModeChange();
    }
    var bth=document.getElementById('billingThresh');
    if(bth && d.bt !== undefined && document.activeElement !== bth) bth.value=d.bt;
    var bmn=document.getElementById('billingMoney');
    if(bmn && d.bm !== undefined && document.activeElement !== bmn) bmn.value=d.bm;
    var btt=document.getElementById('billingTime');
    if(btt && d.btt !== undefined && document.activeElement !== btt) btt.value=d.btt;
    var bus=document.getElementById('billingUsed');
    if(bus && d.bu !== undefined) bus.textContent=d.bu.toFixed(2)+'度';
    var bum=document.getElementById('billingUsedMoney');
    if(bum && d.bum !== undefined) bum.textContent='¥'+d.bum.toFixed(2);
    var but=document.getElementById('billingUsedTime');
    if(but && d.but !== undefined) but.textContent=d.but+'分钟';
    var bcost=document.getElementById('currentCost');
    if(bcost){
      var price=d.ep||parseFloat(document.getElementById('energyPrice')?.value)||0.6;
      if(d.ep !== undefined) document.getElementById('energyPrice').value=d.ep;
      if(d.bu !== undefined){
        bcost.textContent='¥'+(d.bu*price).toFixed(2);
      }else{
        bcost.textContent='--';
      }
    }
    var me=document.getElementById('monthEnergy');
    if(me) me.textContent=d.mo!==undefined?d.mo.toFixed(2)+'度':'--';
    var lme=document.getElementById('lastMonthEnergy');
    if(lme) lme.textContent=d.lm!==undefined?d.lm.toFixed(2)+'度':'--';

    // WiFi 检测状态
    var wdt=document.getElementById('wifiDetectToggle');
    if(wdt){if(d.de)wdt.classList.add('on');else wdt.classList.remove('on');}
    var wdl=document.getElementById('wifiDetectLinkToggle');
    if(wdl){if(d.dl)wdl.classList.add('on');else wdl.classList.remove('on');}
    var wdom=document.getElementById('wdOnlyMaster');
    if(wdom){if(d.om)wdom.classList.add('on');else wdom.classList.remove('on');}
    var bdt=document.getElementById('buttonDetectToggle');
    if(bdt){if(d.bd)bdt.classList.add('on');else bdt.classList.remove('on');}
    var wdtgt=document.getElementById('wifiDetectTarget');
    if(wdtgt){
      if(d.dt && d.dt.length>0){
        wdtgt.textContent=d.dt;
      }else{
        wdtgt.textContent='等待记录';
      }
    }
    var wdmr=document.getElementById('wifiDetectMacRow');
    var wdmv=document.getElementById('wifiDetectMacVal');
    if(wdmr && wdmv){
      if(d.dm && d.dm.length>0){
        wdmr.style.display='flex';
        wdmv.textContent=d.dm;
      }else{
        wdmr.style.display='none';
      }
    }
    var wdss=document.getElementById('wifiSettingsScanSpeed');
    if(wdss && d.ds !== undefined) wdss.value=d.ds;
    var wsss=document.getElementById('wifiSettingsScanSpeed');
    if(wsss && d.ds !== undefined) wsss.value=d.ds;
    var wsrs=document.getElementById('wifiSettingsRssi');
    if(wsrs && d.dr !== undefined){
      wsrs.value=d.dr;
      document.getElementById('wifiSettingsRssiVal').textContent=d.dr+' dBm';
    }
    var wdsv=document.getElementById('wifiDetectSettingsVal');
    if(wdsv){
      var rssi=d.dr||-70;
      var speeds=['慢(30秒)','中(15秒)','快(5秒)','自动学习'];
      var speedIdx=d.ds!==undefined?d.ds:1;
      wdsv.textContent='RSSI:'+rssi+'dBm | '+speeds[speedIdx];
    }
    var wauto=document.getElementById('wifiAutoStatus');
    var wav=document.getElementById('wifiAutoStatusVal');
    if(wauto && wav && d.ds===3){
      wauto.style.display='flex';
      var curInterval=d.dci||15;
      var curHour=d.dch||0;
      var prob=d.dhp||'--';
      wav.textContent='当前:'+curHour+'时 | 间隔:'+curInterval+'秒 | 出现概率:'+prob;
    }else if(wauto){
      wauto.style.display='none';
    }
    var wds=document.getElementById('wifiDetectStatus');
    if(wds){
      if(d.de){
        if(d.tr && d.tl && d.ts===1){
          var mins=Math.floor(d.tl/60);
          var secs=d.tl%60;
          wds.textContent='信号消失 | 倒计时'+mins+'分'+secs+'秒';
          wds.style.color='#ff3b30';
        }else if(d.dp){
          wds.textContent='信号在线 (继电器已开启)';
          wds.style.color='#34c759';
        }else{
          wds.textContent='等待目标信号出现...';
          wds.style.color='#8e8e93';
        }
      }else{
        wds.textContent='已关闭';
        wds.style.color='#8e8e93';
      }
    }
    var wrt=document.getElementById('wifiDetectRange');
    if(wrt && d.dr !== undefined && document.activeElement !== wrt){
      wrt.value=d.dr;
      var wrtVal=document.getElementById('wifiDetectRangeVal');
      if(wrtVal) wrtVal.textContent=d.dr+' dBm';
    }

    // 快速倒计时卡片状态同步
    var qtm=document.getElementById('qtm');
    if(qtm){
      if(d.te && d.tr){
        var qrem=d.tl||0;
        // 同步本地计时器（偏差>3秒才校准，避免重复启动）
        if(qTimerRemain===0 || Math.abs(qTimerRemain-qrem)>3){
          startQuickTimerDisplay(qrem);
        }
      }else{
        qTimerRemain=0;
        if(qTimerInterval){clearInterval(qTimerInterval);qTimerInterval=null;}
        qtm.classList.remove('active');
        qtm.textContent='启动倒计时';
      }
    }
    }catch(e){console.log('UI update error:',e);}
    var lo=document.getElementById('loadingOverlay');
    if(lo)lo.classList.add('hide');
    updateLog();
    updateCrashLog();
    scheduleUpdate();
  }).catch(function(e){console.log('Status fetch error:',e);
    var lo=document.getElementById('loadingOverlay');
    if(lo)lo.classList.add('hide');
    updateLog();
    updateCrashLog();
    scheduleUpdate();
  });
}

