S0DX/esp8266-powerstrip/src/web_config.cpp
function fmt(s){
  var d=Math.floor(s/86400);
  var h=Math.floor((s%86400)/3600);
  var m=Math.floor((s%3600)/60);
  return(d>0?d+'天 ':'')+(h>0?h+'时 ':'')+m+'分';
}
function updateLog(){
  var slog=document.getElementById('sysLogToggle');
  if(slog && !slog.classList.contains('on')){
    var el=document.getElementById('sysLog');
    if(el) el.textContent='--';
    return;
  }
  fetch('/api/log').then(function(r){return r.json()}).then(function(lines){
    var el=document.getElementById('sysLog');
    if(!el) return;
    if(!lines || lines.length===0){el.textContent='--';return;}
    el.textContent=lines.join('\n');
    el.scrollTop=el.scrollHeight;
  }).catch(function(e){console.log('Log fetch error:',e);});
}
function toggleSysLog(){
  var el=document.getElementById('sysLogToggle');
  var enabled=el?!el.classList.contains('on'):false;
  fetch('/api/sys_log',{method:'POST',headers:{'Content-Type':'application/json'},body:JSON.stringify({enabled:enabled})})
    .then(function(r){return r.json();}).then(function(d){
      if(el){if(d.enabled)el.classList.add('on');else el.classList.remove('on');}
      var slc=document.getElementById('sysLogContainer');
      var clc=document.getElementById('crashLogContainer');
      if(slc)slc.style.display=d.enabled?'flex':'none';
      if(clc)clc.style.display=d.enabled?'flex':'none';
    }).catch(function(e){console.log('Sys log toggle error:',e);});
}
function updateCrashLog(){
  fetch('/api/crash_log').then(function(r){return r.json()}).then(function(d){
    var el=document.getElementById('crashLog');
    if(!el) return;
    if(!d || !d.logs || d.logs.length===0){el.textContent='--';return;}
    el.textContent='上次复位: '+(d.reason||'unknown')+'\n'+d.logs.join('\n');
    el.scrollTop=el.scrollHeight;
  }).catch(function(e){console.log('Crash log fetch error:',e);});
}
function toggleAutoCloseAP(){
  var el=document.getElementById('autoCloseAPToggle');
  var enabled=el?!el.classList.contains('on'):false;
  fetch('/api/auto_close_ap',{method:'POST',headers:{'Content-Type':'application/json'},body:JSON.stringify({enabled:enabled})})
    .then(function(r){return r.json();}).then(function(d){
      if(el){if(d.enabled)el.classList.add('on');else el.classList.remove('on');}
    }).catch(function(e){console.log('Auto close AP error:',e);});
}
function toggleWiFiTxPower(){
  var el=document.getElementById('wifiTxPowerToggle');
  var enabled=el?!el.classList.contains('on'):false;
  fetch('/api/wifi_tx_power',{method:'POST',headers:{'Content-Type':'application/json'},body:JSON.stringify({enabled:enabled})})
    .then(function(r){return r.json();}).then(function(d){
      if(el){if(d.enabled)el.classList.add('on');else el.classList.remove('on');}
    }).catch(function(e){console.log('WiFi TX power error:',e);});
}
function loadCardOrder(retries){
  fetch('/api/card_order').then(function(r){return r.json()}).then(function(d){
    if(d.order && d.order.length===6){
      var changed=false;
      for(var i=0;i<6;i++){if(cardOrder[i]!==d.order[i]){changed=true;break;}}
      if(changed){cardOrder=d.order;renderCards(cardOrder);}
    }
  }).catch(function(){
    if(retries < 5){
      setTimeout(function(){loadCardOrder(retries+1);}, 1500);
    }
  });
}
var cardOrder=[0,1,2,3,4,5];
var cardVisibility=0x3F;
var cardNames=['继电器控制','人来上电','实时电量','用电历史','WiFi 状态','快速倒计时'];

function renderCards(order){
  cardOrder=order||[0,1,2,3,4,5];
  var container=document.getElementById('cardsContainer');
  if(!container)return;
  container.innerHTML='';
  var tpl=document.getElementById('cardTemplates');
  if(!tpl)return;
  var resetEls=tpl.querySelectorAll('[id]');
  for(var r=0;r<resetEls.length;r++){
    if(resetEls[r].id.indexOf('_tpl_')===0) resetEls[r].id=resetEls[r].id.substring(5);
  }
  var cards=tpl.querySelectorAll('.card');
  for(var i=0;i<cardOrder.length;i++){
    var idx=cardOrder[i];
    if(!(cardVisibility & (1<<idx))) continue;
    if(idx>=0 && idx<cards.length){
      var clone=cards[idx].cloneNode(true);
      clone.style.animation='cardIn .3s ease '+(i*0.05)+'s both';
      container.appendChild(clone);
    }
  }
  var tplEls=tpl.querySelectorAll('[id]');
  for(var i=0;i<tplEls.length;i++) tplEls[i].id='_tpl_'+tplEls[i].id;
  var rm=document.getElementById('rm');if(rm)rm.addEventListener('click',function(){tr('m')});
  var rs=document.getElementById('rs');if(rs)rs.addEventListener('click',function(){tr('s')});
  var lk=document.getElementById('lk');if(lk)lk.addEventListener('click',toggleLock);
  var mt=document.getElementById('mt');if(mt)mt.addEventListener('click',toggleMeter);
  var wb=document.getElementById('wifiBtn');if(wb)wb.addEventListener('click',showWifi);
  setTimeout(function(){loadHistory();},100);
}

function renderSortList(order){
  var list=document.getElementById('sortList');
  if(!list)return;
  list.innerHTML='';
  var items=order||cardOrder;
  for(var i=0;i<items.length;i++){
    var div=document.createElement('div');
    div.className='sort-item';
    div.setAttribute('data-index',items[i]);
    var vis=(cardVisibility & (1<<items[i]))?' on':'';
    div.innerHTML='<span class="drag-handle">&#9776;</span><span class="sort-name">'+cardNames[items[i]]+'</span><div class="sort-toggle'+vis+'" onclick="toggleCardVis('+items[i]+',event)"></div>';
    list.appendChild(div);
  }
  initDragSort();
}

var dragItem=null,dragIdx=0;
function initDragSort(){
  var list=document.getElementById('sortList');if(!list)return;
  var items=list.querySelectorAll('.sort-item');
  for(var i=0;i<items.length;i++){
    if(items[i].dataset.dragInit==='1') continue;
    items[i].dataset.dragInit='1';
    items[i].addEventListener('touchstart',function(e){
      var h=e.target.closest('.drag-handle');if(!h)return;
      e.preventDefault();dragItem=this;dragIdx=Array.prototype.indexOf.call(this.parentNode.children,this);
      this.classList.add('dragging');
    },{passive:false});
    items[i].addEventListener('touchmove',function(e){
      if(!dragItem)return;e.preventDefault();
      var y=e.touches[0].clientY;var list=dragItem.parentNode;
      var items=Array.prototype.slice.call(list.children);
      for(var j=0;j<items.length;j++){
        var r=items[j].getBoundingClientRect(),mid=r.top+r.height/2;
        if(items[j]!==dragItem){if((j>dragIdx&&y>mid)||(j<dragIdx&&y<mid)){list.insertBefore(dragItem,j>dragIdx?items[j].nextSibling:items[j]);dragIdx=j;break;}}
      }
    },{passive:false});
    items[i].addEventListener('touchend',function(){
      if(!dragItem)return;dragItem.classList.remove('dragging');
      var list=dragItem.parentNode;var items=list.querySelectorAll('.sort-item');
      var newOrder=[];for(var k=0;k<items.length;k++)newOrder.push(parseInt(items[k].getAttribute('data-index')));
      cardOrder=newOrder;
      fetch('/api/card_order',{method:'POST',headers:{'Content-Type':'application/json'},body:JSON.stringify({order:newOrder})}).then(function(r){return r.json()}).then(function(d){if(d.ok){alert('卡片顺序已保存');}}).catch(function(e){console.log('save order error',e);});
      dragItem=null;
    });
  }
}

