S0DX/esp8266-powerstrip/src/web_config.cpp
function toggleButtonAutoTimer(){
  var wt=document.getElementById('buttonAutoTimerToggle');
  if(!wt)return;
  var en=!wt.classList.contains('on');
  wt.classList.toggle('on');
  fetch('/api/button_auto_timer?enabled='+en);
}

function saveApSuffix(){
  var v=document.getElementById('apSuffix').value||'0';
  fetch('/api/ap_suffix',{method:'POST',headers:{'Content-Type':'application/json'},body:JSON.stringify({suffix:v})}).then(function(){
    alert('AP 后缀已保存，热点将重启生效');
  });
}

function validateHostname(el){
  var v=el.value.toLowerCase().replace(/[^a-z0-9-]/g,'');
  if(v!==el.value) el.value=v;
  var hint=document.getElementById('hostnameHint');
  var preview=document.getElementById('hostnamePreview');
  if(v.length>=1 && v.length<=10){
    preview.textContent=v+'.local';
    hint.style.color='#8e8e93';
  }else{
    hint.style.color='#ff3b30';
  }
}

function saveHostname(){
  var el=document.getElementById('hostname');
  var v=el.value.trim().toLowerCase();
  if(v.length===0){ v='power'; }
  if(v.length<1 || v.length>10 || !/^[a-z0-9]([a-z0-9-]*[a-z0-9])?$/.test(v)){
    alert('域名格式错误：1-10 位，仅小写字母、数字、连字符，且不能以连字符开头或结尾');
    return;
  }
  fetch('/api/hostname',{method:'POST',headers:{'Content-Type':'application/json'},body:JSON.stringify({hostname:v})}).then(function(r){return r.json();}).then(function(d){
    if(d.ok){
      alert('局域网域名已保存为 '+v+'.local，mDNS 已更新');
      document.getElementById('hostnamePreview').textContent=v+'.local';
    }else{
      alert('保存失败：'+(d.error||'格式错误'));
    }
  }).catch(function(e){console.log('save hostname error',e);});
}

function toggleCardVis(idx,ev){
  if(ev) ev.stopPropagation();
  cardVisibility ^= (1<<idx);
  var list=document.getElementById('sortList');
  if(list){
    var item=list.querySelector('[data-index="'+idx+'"]');
    if(item){
      var tog=item.querySelector('.sort-toggle');
      if(tog){
        if(cardVisibility & (1<<idx)) tog.classList.add('on');
        else tog.classList.remove('on');
      }
    }
  }
  fetch('/api/card_visibility',{method:'POST',headers:{'Content-Type':'application/json'},body:JSON.stringify({v:cardVisibility})}).then(function(){
    renderCards(cardOrder);
  });
}

var _relayBusy=false;
function tr(w){
  if(_relayBusy) return;
  _relayBusy=true;
  var t=document.getElementById(w=='m'?'rm':'rs');
  var other=document.getElementById(w=='m'?'rs':'rm');
  if(t) t.classList.toggle('on');
  if(w=='s' && t && t.classList.contains('on')){
    if(other && !other.classList.contains('on')) other.classList.add('on');
  }
  if(w=='m' && t && !t.classList.contains('on')){
    if(other) other.classList.remove('on');
  }
  fetch('/api/relay?w='+w).then(function(r){return r.json()}).then(function(d){
    var rm=document.getElementById('rm');
    var rs=document.getElementById('rs');
    if(rm){if(d.m)rm.classList.add('on');else rm.classList.remove('on');}
    if(rs){if(d.s)rs.classList.add('on');else rs.classList.remove('on');}
  }).catch(function(e){console.log('Relay error:',e);})
  .finally(function(){setTimeout(function(){_relayBusy=false;},300);});
}

function toggleMeter(){
  var mt = document.getElementById('mt');
  if(!mt) return;
  var enabled = !mt.classList.contains('on');
  fetch('/api/meter?a='+(enabled?'on':'off')).then(function(r){return r.json()}).then(function(d){
    update();
  }).catch(function(e){console.log('Meter error:',e)});
}

function toggleTimer(){
  var tm = document.getElementById('tm');
  if(!tm) return;
  if(tm.classList.contains('active')){
    fetch('/api/timer?enabled=false').then(function(r){return r.json()}).then(function(){
      update();
    }).catch(function(e){console.log('Timer error:',e)});
  }else{
    var dur=document.getElementById('timerDuration').value;
    if(!dur || dur==0){alert('请先选择倒计时时长');return;}
    fetch('/api/timer?duration='+dur+'&enabled=true').then(function(r){return r.json()}).then(function(){
      update();
    }).catch(function(e){console.log('Timer error:',e)});
  }
}

function setTimerDuration(mins){
  fetch('/api/timer?duration='+mins).then(function(r){return r.json()}).then(function(d){
    console.log('Timer duration set to:',d.duration);
  }).catch(function(e){console.log('Timer duration error:',e)});
}

// iOS 风格快速倒计时选择器
var qPickerInited=false,qPickerUserSet=false,qPickerSelectedMins=60;
function initQuickTimerPicker(){
  var hItems=document.getElementById('hourItems');
  var mItems=document.getElementById('minuteItems');
  if(!hItems || !mItems) return;
  // 如果卡片被重新渲染导致子元素丢失，需要重新初始化
  if(qPickerInited && hItems.children.length>0 && mItems.children.length>0) return;
  hItems.innerHTML='';
  mItems.innerHTML='';
  for(var i=0;i<=23;i++){
    var d=document.createElement('div');d.className='time-picker-item';d.textContent=i;
    d.dataset.value=i;hItems.appendChild(d);
  }
  for(var i=0;i<=59;i++){
    var d=document.createElement('div');d.className='time-picker-item';d.textContent=i;
    d.dataset.value=i;mItems.appendChild(d);
  }
  function setItemOpacity(items,idx){
    for(var i=0;i<items.children.length;i++){
      var dist=Math.abs(i-idx);
      var op;
      if(dist===0) op=1;
      else if(dist===1) op=0.45;
      else if(dist===2) op=0.22;
      else op=0.1;
      items.children[i].style.opacity=op;
      items.children[i].classList.toggle('active',i===idx);
    }
  }
  function onScroll(col,items,maxVal){
    return function(){
      var itemHeight=36;
      var idx=Math.round(col.scrollTop/itemHeight);
      if(idx<0) idx=0;
      if(idx>=items.children.length) idx=items.children.length-1;
      if(idx>maxVal) idx=maxVal;
      setItemOpacity(items,idx);
      qPickerUserSet=true;
      qPickerSelectedMins=getQuickTimerPickerValue();
    };
  }
  function onClick(col,maxVal){
    return function(e){
      var rect=col.getBoundingClientRect();
      var y=e.clientY-rect.top;
      var idx=Math.round(col.scrollTop/36);
      if(y<rect.height/2) idx=Math.max(0,idx-1); else idx=Math.min(maxVal,idx+1);
      col.scrollTo({top:idx*36,behavior:'smooth'});
      qPickerUserSet=true;
    };
  }
  var hCol=document.getElementById('hourCol');
  var mCol=document.getElementById('minuteCol');
  hCol.addEventListener('scroll',onScroll(hCol,hItems,23));
  mCol.addEventListener('scroll',onScroll(mCol,mItems,59));
  hCol.addEventListener('click',onClick(hCol,23));
  mCol.addEventListener('click',onClick(mCol,59));
  qPickerInited=true;
}
function setQuickTimerPickerValue(totalMins,force){
  if(qPickerUserSet && !force) return;
  var hCol=document.getElementById('hourCol');
  var mCol=document.getElementById('minuteCol');
  if(!hCol || !mCol) return;
  var hrs=Math.floor(totalMins/60);
  var mins=totalMins%60;
  if(hrs<0) hrs=0; if(hrs>23) hrs=23;
  if(mins<0) mins=0; if(mins>59) mins=59;
  hCol.scrollTop=hrs*36;
  mCol.scrollTop=mins*36;
  qPickerSelectedMins=hrs*60+mins;
  updateQuickTimerPickerActive();
}
function updateQuickTimerPickerActive(){
  var hItems=document.getElementById('hourItems');
  var mItems=document.getElementById('minuteItems');
  if(!hItems || !mItems) return;
  var hCol=document.getElementById('hourCol');
  var mCol=document.getElementById('minuteCol');
  var hIdx=Math.round(hCol.scrollTop/36);
  var mIdx=Math.round(mCol.scrollTop/36);
  if(hIdx<0) hIdx=0; if(hIdx>23) hIdx=23;
  if(mIdx<0) mIdx=0; if(mIdx>59) mIdx=59;
  function setOp(items,idx){
    for(var i=0;i<items.children.length;i++){
      var dist=Math.abs(i-idx);
      var op;
      if(dist===0) op=1;
      else if(dist===1) op=0.45;
      else if(dist===2) op=0.22;
      else op=0.1;
      items.children[i].style.opacity=op;
      items.children[i].classList.toggle('active',i===idx);
    }
  }
  setOp(hItems,hIdx);
  setOp(mItems,mIdx);
}
function getQuickTimerPickerValue(){
  var hCol=document.getElementById('hourCol');
  var mCol=document.getElementById('minuteCol');
  if(!hCol || !mCol) return qPickerSelectedMins;
  var hrs=Math.round(hCol.scrollTop/36);
  var mins=Math.round(mCol.scrollTop/36);
  if(hrs<0) hrs=0; if(hrs>23) hrs=23;
  if(mins<0) mins=0; if(mins>59) mins=59;
  return hrs*60+mins;
}

// 快速倒计时卡片：一键启动 + 动态显示剩余时间
var qTimerRemain=0, qTimerInterval=null;
function toggleQuickTimer(){
  var qtm=document.getElementById('qtm');
  if(!qtm) return;
  if(qtm.classList.contains('active')){
    fetch('/api/timer?enabled=false').then(function(r){return r.json()}).then(function(){
      qTimerRemain=0;
      if(qTimerInterval){clearInterval(qTimerInterval);qTimerInterval=null;}
      qPickerUserSet=false;
      update();
    }).catch(function(e){console.log('QuickTimer error:',e)});
  }else{
    var dur=qPickerSelectedMins;
    if(dur<=0){alert('请先选择倒计时时长');return;}
    fetch('/api/timer?duration='+dur+'&enabled=true').then(function(r){return r.json()}).then(function(){
      qPickerUserSet=false;
      update();
    }).catch(function(e){console.log('QuickTimer error:',e)});
  }
}
function startQuickTimerDisplay(remain){
  qTimerRemain=remain;
  if(qTimerInterval) clearInterval(qTimerInterval);
  qTimerInterval=setInterval(function(){
    if(qTimerRemain>0){
      qTimerRemain--;
      updateQuickTimerBtn();
    }else{
      clearInterval(qTimerInterval);
      qTimerInterval=null;
      update();
    }
  },1000);
  updateQuickTimerBtn();
}
function updateQuickTimerBtn(){
  var qtm=document.getElementById('qtm');
  if(!qtm) return;
  if(qTimerRemain>0){
    var rh=Math.floor(qTimerRemain/3600);
    var rMin=Math.floor((qTimerRemain%3600)/60);
    var rSec=Math.floor(qTimerRemain%60);
    qtm.classList.add('active');
    qtm.textContent='关闭 '+(rh>0?rh+':':'')+String(rMin).padStart(2,'0')+':'+String(rSec).padStart(2,'0');
  }else{
    qtm.classList.remove('active');
    qtm.textContent='启动倒计时';
  }
}

function toggleLock(){
  fetch('/api/lock').then(function(r){return r.json()}).then(function(d){
    var lk=document.getElementById('lk');
    if(d.locked)lk.classList.add('on');else lk.classList.remove('on');
  }).catch(function(e){console.log('Lock error:',e)});
}

function toggleCycle(){
  var ct=document.getElementById('cycleToggle');
  if(!ct)return;
  var en=!ct.classList.contains('on');
  if(en){
    var st=document.getElementById('cStartTime').value;
    var et=document.getElementById('cEndTime').value;
    if(!st || !et || st=='' || et==''){
      alert('请先设置循环时间段');
      return;
    }
  }
  fetch('/api/cycle?enabled='+en).then(function(r){return r.json()}).then(function(d){
    if(d.enabled)ct.classList.add('on');else ct.classList.remove('on');
  });
}
function addCyclePeriod(){
  var s=document.getElementById('cStartTime').value;
  var e=document.getElementById('cEndTime').value;
  if(!s||!e){alert('请选择时间');return;}
  var st=s.split(':'),et=e.split(':');
  fetch('/api/cycle?add=1&sh='+st[0]+'&sm='+st[1]+'&eh='+et[0]+'&em='+et[1]).then(function(r){return r.json()}).then(function(d){
    if(d.ok){update();}else{alert('最多3个时段');}
  });
}

