S0DX/esp8266-powerstrip/src/web_config.cpp
function removeCyclePeriod(idx){
  fetch('/api/cycle?remove='+idx).then(function(r){return r.json()}).then(function(d){
    if(d.ok)update();
  });
}

function renderCyclePeriods(cp){
  var list=document.getElementById('cyclePeriodsList');
  if(!list)return;
  list.innerHTML='';
  if(!cp||cp.length===0)return;
  for(var i=0;i<cp.length;i++){
    var p=cp[i];
    var div=document.createElement('div');
    div.style.cssText='display:flex;align-items:center;gap:8px;padding:8px 0;border-bottom:1px solid #e5e5ea';
    div.innerHTML='<span style="flex:1;font-size:14px">'+String(p.sh).padStart(2,'0')+':'+String(p.sm).padStart(2,'0')+' - '+String(p.eh).padStart(2,'0')+':'+String(p.em).padStart(2,'0')+'</span>'
      +'<button class="timer-btn" style="width:auto;margin:0;padding:0 12px;height:28px;font-size:12px;background:#ff3b30" onclick="removeCyclePeriod('+i+')">删除</button>';
    list.appendChild(div);
  }
}

var _wifiDetectBusy=false;
function toggleWifiDetect(){
  if(_wifiDetectBusy)return;_wifiDetectBusy=true;
  var wt=document.getElementById('wifiDetectToggle');
  if(!wt){_wifiDetectBusy=false;return;}
  var en=!wt.classList.contains('on');
  wt.classList.toggle('on');
  fetch('/api/wifidetect?enabled='+en).then(function(r){return r.json()}).then(function(d){
    if(d.enabled){wt.classList.add('on');}else{wt.classList.remove('on');}
  }).catch(function(e){console.log('WifiDetect error:',e);})
  .finally(function(){setTimeout(function(){_wifiDetectBusy=false;},300);});
}

function toggleWifiDetectLink(){
  if(_wifiDetectBusy)return;_wifiDetectBusy=true;
  var wt=document.getElementById('wifiDetectLinkToggle');
  if(!wt){_wifiDetectBusy=false;return;}
  var en=!wt.classList.contains('on');
  wt.classList.toggle('on');
  fetch('/api/wifidetect?linkTimer='+en).then(function(r){return r.json()}).then(function(d){
    if(d.linkTimer){wt.classList.add('on');}else{wt.classList.remove('on');}
  }).catch(function(e){console.log('WifiDetectLink error:',e);})
  .finally(function(){setTimeout(function(){_wifiDetectBusy=false;},300);});
}

function toggleWifiDetectOnlyMaster(){
  if(_wifiDetectBusy)return;_wifiDetectBusy=true;
  var wt=document.getElementById('wdOnlyMaster');
  if(!wt){_wifiDetectBusy=false;return;}
  var en=!wt.classList.contains('on');
  wt.classList.toggle('on');
  fetch('/api/wifidetect?onlyMaster='+en).catch(function(e){console.log('OnlyMaster error:',e);})
  .finally(function(){setTimeout(function(){_wifiDetectBusy=false;},300);});
}

function saveWifiRange(){
  var range=document.getElementById('wifiSettingsRssi').value;
  fetch('/api/wifidetect?rssi='+range).then(function(){alert('检测距离已保存')});
}

function saveScanSpeed(){
  var speed=document.getElementById('wifiSettingsScanSpeed').value;
  fetch('/api/wifidetect?scanSpeed='+speed);
}

function showWifiDetectSettings(){
  document.getElementById('wifiSettingsM').style.display='flex';
  var wsrs=document.getElementById('wifiSettingsRssi');
  var wsss=document.getElementById('wifiSettingsScanSpeed');
  if(wsrs && wsrs.value) document.getElementById('wifiSettingsRssiVal').textContent=wsrs.value+' dBm';
}

function closeWifiDetectSettings(){
  document.getElementById('wifiSettingsM').style.display='none';
}

function showWifiDetectMore(){
  document.getElementById('wifiDetectMoreM').style.display='flex';
}

function closeWifiDetectMore(){
  document.getElementById('wifiDetectMoreM').style.display='none';
}

// ============= 电表校准 =============
function showMeterMore(){
  document.getElementById('meterMoreM').style.display='flex';
}
function closeMeterMore(){
  document.getElementById('meterMoreM').style.display='none';
}
function _calibBusy(btn){
  if(btn){btn.disabled=true;btn.textContent='处理中...';}
}
function _calibDone(btn,text){
  if(btn){btn.disabled=false;btn.textContent=text;}
}
function doCalibV(){
  var v=parseFloat(document.getElementById('calibV').value);
  if(!v||v<=0||v>300){alert('请输入有效电压（1-300V）');return;}
  var btn=event.target;_calibBusy(btn);
  fetch('/api/meter_calib?a=v&v='+v).then(function(r){return r.json()})
  .then(function(d){
    alert(d.ok?'电压校准成功':'电压校准失败：'+(d.error||'未知错误'));
    _calibDone(btn,'校准');
  }).catch(function(e){alert('请求失败:'+e);_calibDone(btn,'校准');});
}
function doCalibI(){
  var i=parseFloat(document.getElementById('calibI').value);
  if(!i||i<=0||i>100){alert('请输入有效电流（0.001-100A）');return;}
  var btn=event.target;_calibBusy(btn);
  fetch('/api/meter_calib?a=i&v='+i).then(function(r){return r.json()})
  .then(function(d){
    alert(d.ok?'电流校准成功':'电流校准失败：'+(d.error||'未知错误'));
    _calibDone(btn,'校准');
  }).catch(function(e){alert('请求失败:'+e);_calibDone(btn,'校准');});
}
function doResetCalib(){
  if(!confirm('确认恢复出厂校准？这将覆盖当前校准值。'))return;
  var btn=event.target;_calibBusy(btn);
  fetch('/api/meter_calib?a=reset').then(function(r){return r.json()})
  .then(function(d){
    alert(d.ok?'已恢复出厂校准':'恢复失败：'+(d.error||'未知错误'));
    _calibDone(btn,'恢复出厂校准');
  }).catch(function(e){alert('请求失败:'+e);_calibDone(btn,'恢复出厂校准');});
}
function doSaveCalib(){
  var btn=event.target;_calibBusy(btn);
  fetch('/api/meter_calib?a=save').then(function(r){return r.json()})
  .then(function(d){
    alert(d.ok?'校准已保存到 Flash':'保存失败：'+(d.error||'未知错误'));
    _calibDone(btn,'保存校准到 Flash');
  }).catch(function(e){alert('请求失败:'+e);_calibDone(btn,'保存校准到 Flash');});
}
function doClearEnergy(){
  if(!confirm('确认清零电能计数器？此操作不可恢复。'))return;
  var btn=event.target;_calibBusy(btn);
  fetch('/api/meter_calib?a=clear').then(function(r){return r.json()})
  .then(function(d){
    alert(d.ok?'电能计数器已清零':'清零失败：'+(d.error||'未知错误'));
    _calibDone(btn,'清零电能计数器');
  }).catch(function(e){alert('请求失败:'+e);_calibDone(btn,'清零电能计数器');});
}

function toggleButtonDetect(){
  if(_wifiDetectBusy)return;_wifiDetectBusy=true;
  var bt=document.getElementById('buttonDetectToggle');
  if(!bt){_wifiDetectBusy=false;return;}
  var en=!bt.classList.contains('on');
  bt.classList.toggle('on');
  fetch('/api/button_detect?enabled='+en).catch(function(e){console.log('ButtonDetect error:',e);})
  .finally(function(){setTimeout(function(){_wifiDetectBusy=false;},300);});
}

function saveWifiDetectSettings(){
  var rssi=document.getElementById('wifiSettingsRssi').value;
  var speed=document.getElementById('wifiSettingsScanSpeed').value;
  fetch('/api/wifidetect?rssi='+rssi+'&scanSpeed='+speed).then(function(){
    closeWifiDetectSettings();
    update();
  });
}


function toggleMqtt(){
  var mt=document.getElementById('mqttToggle');
  if(!mt)return;
  var en=!mt.classList.contains('on');
  fetch('/api/mqtt?enabled='+en,{method:'POST'}).then(function(r){return r.json()}).then(function(d){
    if(d.enabled)mt.classList.add('on');else mt.classList.remove('on');
  });
}

function togglePowerOff(){
  var pt=document.getElementById('pwrOffToggle');
  if(!pt)return;
  var en=!pt.classList.contains('on');
  fetch('/api/poweroff?enabled='+en).then(function(r){return r.json()}).then(function(d){
    if(d.enabled)pt.classList.add('on');else pt.classList.remove('on');
    syncPowerOffHome(d.enabled);
  });
}

function togglePowerOffHome(){
  var pt=document.getElementById('pwrOffHome');
  if(!pt)return;
  var en=!pt.classList.contains('on');
  fetch('/api/poweroff?enabled='+en).then(function(r){return r.json()}).then(function(d){
    syncPowerOffHome(d.enabled);
  });
}

function syncPowerOffHome(enabled){
  var pt=document.getElementById('pwrOffHome');
  if(pt){if(enabled)pt.classList.add('on');else pt.classList.remove('on');}
}

