S0DX/esp8266-powerstrip/src/web_config.cpp
function savePowerOff(){
  var th=document.getElementById('pwrThresh').value;
  fetch('/api/poweroff?threshold='+th).then(function(){alert('保存成功')});
}

function onBillingModeChange(){
  var mode=document.getElementById('billingMode').value;
  document.getElementById('billingEnergyRow').style.display=mode=='0'?'flex':'none';
  document.getElementById('billingMoneyRow').style.display=mode=='1'?'flex':'none';
  document.getElementById('billingTimeRow').style.display=mode=='2'?'flex':'none';
}

function toggleBilling(){
  var bt=document.getElementById('billingToggle');
  if(!bt)return;
  var en=!bt.classList.contains('on');
  fetch('/api/billing?enabled='+en).then(function(r){return r.json()}).then(function(d){
    if(d.enabled)bt.classList.add('on');else bt.classList.remove('on');
    if(d.used !== undefined) document.getElementById('billingUsed').textContent=d.used.toFixed(2)+'度';
    if(d.usedMoney !== undefined) document.getElementById('billingUsedMoney').textContent='¥'+d.usedMoney.toFixed(2);
    if(d.usedTime !== undefined) document.getElementById('billingUsedTime').textContent=d.usedTime+'分钟';
  });
}

function saveBilling(){
  var mode=document.getElementById('billingMode').value;
  var qs='mode='+mode;
  if(mode=='0'){
    qs+='&threshold='+document.getElementById('billingThresh').value;
  }else if(mode=='1'){
    qs+='&money='+document.getElementById('billingMoney').value;
  }else if(mode=='2'){
    qs+='&time='+document.getElementById('billingTime').value;
  }
  fetch('/api/billing?'+qs).then(function(r){return r.json()}).then(function(d){
    alert('保存成功');
  });
}

function savePrice(){
  var price=document.getElementById('energyPrice').value;
  var data=new URLSearchParams();
  data.append('price',price);
  fetch('/api/billing',{method:'POST',body:data}).then(function(){alert('电价已保存')});
}

function resetEnergyHistory(){
  if(!confirm('确定要清零所有历史电量和电费记录吗？此操作不可恢复。')) return;
  fetch('/api/reset_energy',{method:'POST'}).then(function(r){return r.json()}).then(function(d){
    if(d.ok){
      alert('历史记录已清零');
      update();
    }else{
      alert('清零失败');
    }
  }).catch(function(e){alert('请求失败');});
}

function saveMqtt(){
  var data=new URLSearchParams();
  data.append('server',document.getElementById('mqServer').value);
  data.append('port',document.getElementById('mqPort').value);
  data.append('user',document.getElementById('mqUser').value);
  data.append('pass',document.getElementById('mqPass').value);
  fetch('/api/mqtt',{method:'POST',body:data}).then(function(r){return r.json()}).then(function(d){
    if(d.ok)alert('MQTT设置已保存！将尝试连接。');
  });
}

function showWifi(){
  document.getElementById('wifiM').style.display='flex';
  document.getElementById('pwd').style.display='none';
  document.getElementById('connBtn').style.display='none';
  document.getElementById('wifiSucc').classList.add('hidden');
  var selInfo=document.getElementById('wifiSelInfo');
  if(selInfo) selInfo.style.display='none';
  doScan();
}

function showWiFiSelect(){
  document.getElementById('wifiSelM').style.display='flex';
  document.getElementById('wifiSelSucc').classList.add('hidden');
  doScanSelect();
}

function doScan(){
  document.getElementById('wl').innerHTML='<p style="text-align:center;color:#8e8e93">扫描中...</p>';
  fetch('/api/scan').then(function(r){return r.json()}).then(function(d){
    var wl=document.getElementById('wl');
    wl.innerHTML='';
    if(!d || d.length===0){wl.innerHTML='<p style="text-align:center;color:#8e8e93">未找到WiFi</p>';return;}
    d.filter(function(n){return n.ssid.length>0 && !n.ssid.includes('\x00');})
     .sort(function(a,b){return b.rssi-a.rssi;})
     .forEach(function(n){
       var item=document.createElement('div');
       item.className='wifi-item';
       item.innerHTML='<div><div class="name">'+n.ssid+'</div><div class="rssi">'+n.rssi+' dBm</div></div><span class="enc">'+(n.enc?'🔒':'📶')+'</span>';
       item.addEventListener('click',function(){sel(n.ssid,n.enc)});
       wl.appendChild(item);
     });
  }).catch(function(e){document.getElementById('wl').innerHTML='<p style="text-align:center;color:#ff3b30">扫描失败</p>';console.log('Scan error:',e)});
}

function doScanSelect(){
  document.getElementById('wsl').innerHTML='<p style="text-align:center;color:#8e8e93">扫描中...</p>';
  fetch('/api/scan').then(function(r){return r.json()}).then(function(d){
    var wl=document.getElementById('wsl');
    wl.innerHTML='';
    if(!d || d.length===0){wl.innerHTML='<p style="text-align:center;color:#8e8e93">未找到WiFi</p>';return;}
    d.filter(function(n){return n.ssid.length>0 && !n.ssid.includes('\x00');})
     .sort(function(a,b){return b.rssi-a.rssi;})
     .forEach(function(n){
       var item=document.createElement('div');
       item.className='wifi-item';
       item.innerHTML='<div><div class="name">'+n.ssid+'</div><div class="rssi">'+n.rssi+' dBm</div></div><span class="enc">'+(n.enc?'🔒':'📶')+'</span>';
       item.addEventListener('click',function(){selTarget(n.ssid)});
       wl.appendChild(item);
     });
  }).catch(function(e){document.getElementById('wsl').innerHTML='<p style="text-align:center;color:#ff3b30">扫描失败</p>';console.log('Scan error:',e)});
}

function sel(ssid,enc){
  selSSID=ssid;
  var selInfo=document.getElementById('wifiSelInfo');
  var selName=document.getElementById('selWifiName');
  if(selInfo && selName){
    selName.textContent=ssid;
    selInfo.style.display='block';
  }
  if(enc){
    var pwdInput = document.getElementById('pwd');
    pwdInput.style.display='block';
    pwdInput.value='';
    document.getElementById('connBtn').style.display='block';
    pwdInput.focus();
  }else{
    conn(ssid,'');
  }
}

function selTarget(ssid){
  document.getElementById('wifiSelM').style.display='none';
  fetch('/api/wifidetect?target='+encodeURIComponent(ssid)).then(function(){alert('已选择: '+ssid)});
  var tgt=document.getElementById('wifiDetectTarget');
  if(tgt)tgt.textContent=ssid;
}

function conn(ssid,pwd){
  if(!ssid){alert('请选择WiFi');return;}
  var body='ssid='+encodeURIComponent(ssid)+'&password='+encodeURIComponent(pwd||'');
  document.getElementById('wl').innerHTML='<p style="text-align:center;color:#007aff">正在连接...</p>';
  document.getElementById('connBtn').style.display='none';
  fetch('/api/connect',{method:'POST',headers:{'Content-Type':'application/x-www-form-urlencoded'},body:body})
  .then(function(r){return r.json()}).then(function(d){
    if(d.ok && d.status==='connecting'){
      pollConnectStatus();
    }else if(d.ok && d.status==='connected'){
      document.getElementById('wifiSucc').classList.remove('hidden');
      document.getElementById('connSSID').textContent=d.ssid;
      document.getElementById('wl').innerHTML='<p style="text-align:center;color:#34c759">WiFi 连接成功！IP: '+d.ip+'</p>';
      document.getElementById('pwd').style.display='none';
      setTimeout(function(){closeWifi();update();},2000);
    }else{
      document.getElementById('wl').innerHTML='<p style="text-align:center;color:#ff3b30">'+(d.error||'连接失败')+'</p>';
      document.getElementById('connBtn').style.display='block';
    }
  }).catch(function(e){
    document.getElementById('wl').innerHTML='<p style="text-align:center;color:#ff3b30">连接请求失败</p>';
    document.getElementById('connBtn').style.display='block';
    console.log('Connect error:',e);
  });
}

