S0DX/esp8266-powerstrip/src/web_config.cpp
function pollConnectStatus(){
  fetch('/api/connect_status').then(function(r){return r.json()}).then(function(d){
    if(d.status==='connected'){
      document.getElementById('wifiSucc').classList.remove('hidden');
      document.getElementById('connSSID').textContent=d.ssid;
      document.getElementById('wl').innerHTML='<p style="text-align:center;color:#34c759">WiFi 连接成功！IP: '+d.ip+'</p>';
      document.getElementById('pwd').style.display='none';
      setTimeout(function(){closeWifi();update();},2000);
    }else if(d.status==='failed'){
      document.getElementById('wl').innerHTML='<p style="text-align:center;color:#ff3b30">'+d.error+'</p>';
      document.getElementById('connBtn').style.display='block';
    }else if(d.status==='connecting'){
      setTimeout(pollConnectStatus, 1000);
    }else{
      document.getElementById('wl').innerHTML='<p style="text-align:center;color:#ff3b30">连接超时</p>';
      document.getElementById('connBtn').style.display='block';
    }
  }).catch(function(){
    setTimeout(pollConnectStatus, 1000);
  });
}

function closeWifi(){
  document.getElementById('wifiM').style.display='none';
  document.getElementById('pwd').style.display='none';
  document.getElementById('connBtn').style.display='none';
  document.getElementById('wifiSucc').classList.add('hidden');
}

function closeWifiSelect(){
  document.getElementById('wifiSelM').style.display='none';
  document.getElementById('wifiSelSucc').classList.add('hidden');
}

function showOta(){
  document.getElementById('otaM').style.display='flex';
  document.getElementById('ofm').classList.remove('hidden');
  document.getElementById('opg').classList.add('hidden');
}

function doOta(){
  var f=document.getElementById('of').files[0];
  if(!f){alert('请选择固件文件');return;}
  var p=document.getElementById('op').value;
  if(p!=='admin'){alert('密码错误');return;}

  // 核心改进：升级前先关闭电能检测，释放资源
  document.getElementById('ost').textContent='准备升级 (正在关闭计量逻辑)...';
  fetch('/api/meter?a=off').then(function(){
    startActualOta(f);
  }).catch(function(){
    startActualOta(f); // 即使失败也尝试升级
  });
}

function startActualOta(f){
  document.getElementById('ofm').classList.add('hidden');
  document.getElementById('opg').classList.remove('hidden');

  var fd=new FormData();
  fd.append('update',f);  // 使用标准 /update 接口

  var xhr=new XMLHttpRequest();
  xhr.open('POST','/update');
  xhr.setRequestHeader('Authorization', 'Basic ' + btoa('admin:admin'));
  xhr.upload.addEventListener('progress',function(e){
    if(e.lengthComputable){
      var pct=Math.round((e.loaded/e.total)*100);
      document.getElementById('opf').style.width=pct+'%';
      document.getElementById('ost').textContent='正在上传... '+pct+'%';
    }
  });

  xhr.addEventListener('load',function(){
    if(xhr.status === 200 || xhr.status === 302 || xhr.status === 304){
      document.getElementById('ost').textContent='升级成功！设备正在重启...';
      // 5秒后刷新页面
      setTimeout(function(){window.location.reload();},5000);
    } else if(xhr.status === 401){
      document.getElementById('ost').textContent='权限错误 (401)，正在重试...';
      setTimeout(function(){
        // 如果是 401，尝试带上默认的 admin:admin Auth 再次请求一次
        var xhr2 = new XMLHttpRequest();
        xhr2.open('POST', '/update');
        xhr2.setRequestHeader('Authorization', 'Basic ' + btoa('admin:admin'));
        // ... 此处简化处理 ...
        window.location.href = '/update'; // 或者直接跳转到标准更新页
      }, 1000);
    } else {
      document.getElementById('ost').textContent='状态异常: '+xhr.status+' '+xhr.responseText;
      setTimeout(closeOta,5000);
    }
  });

  xhr.addEventListener('error',function(){
    document.getElementById('ost').textContent='通信中断：请检查网络或固件大小 (瞬间100%通常是连接被拒绝)';
    setTimeout(closeOta,5000);
  });

  xhr.send(fd);
}

function closeOta(){
  document.getElementById('otaM').style.display='none';
}

function doReset(){
  if(confirm('确定恢复出厂设置?')){
    fetch('/api/reset',{method:'POST'}).then(function(){alert('设备将重启')}).catch(function(e){console.log('Reset error:',e)});
  }
}

function toggleRedLed(){
  fetch('/api/settings?redLed=toggle').then(function(r){return r.json()}).then(function(d){
    var rlt=document.getElementById('redLedToggle');
    if(d.redLed)rlt.classList.add('on');else rlt.classList.remove('on');
  }).catch(function(e){console.log('Red LED toggle error:',e)});
}

function saveApPass(){
  var p=document.getElementById('apPass').value;
  if(p && p.length>0 && p.length<8){alert('密码长度至少8位');return;}
  fetch('/api/ap_pass?pass='+encodeURIComponent(p), {method:'POST'}).then(function(r){return r.json()}).then(function(d){
    if(d.ok)alert('已保存，请手动重启设备以生效');
  }).catch(function(e){alert('保存失败');console.log('AP pass error:',e)});
}

function confirmRestart(){
  if(confirm('确定要重启设备吗？')){
    fetch('/api/restart', {method:'POST'});
    document.body.innerHTML='<div style="padding:40px;text-align:center;font-size:18px">设备正在重启...</div>';
  }
}

function confirmReset(){
  if(confirm('确定要恢复出厂设置吗？所有配置将被清除！')){
    fetch('/api/reset', {method:'POST'});
    document.body.innerHTML='<div style="padding:40px;text-align:center;font-size:18px">正在恢复出厂设置...</div>';
  }
}

function loadHistory(){
  fetch('/api/history').then(function(r){return r.json()}).then(function(d){
    if(!d.data) return;
    var vals=d.data;
    var max=0;
    for(var i=0;i<vals.length;i++){if(vals[i]>max)max=vals[i];}
    if(max<1)max=1;
    var total=0;
    var now=new Date();
    for(var i=0;i<7;i++){
      var label=document.getElementById('hl'+i);
      var bar=document.getElementById('hb'+i);
      var valEl=document.getElementById('hv'+i);
      if(!bar) continue;
      total+=vals[i];
      var pct=Math.round((vals[i]/max)*88);
      bar.style.height=(pct<2?2:pct)+'px';
      var kwh=vals[i]/1000;
      if(valEl) valEl.textContent=kwh>0?kwh.toFixed(2):'';
      if(label && i<6){
        var d2=new Date(now);
        d2.setDate(now.getDate()-(6-i));
        label.textContent=(d2.getMonth()+1)+'/'+(d2.getDate());
      }
    }
    var ht=document.getElementById('histTotal');
    if(ht) ht.textContent='合计: '+(total/1000).toFixed(2)+' kWh';
    scheduleHistory();
  }).catch(function(e){console.log('History error:',e);scheduleHistory();});
}

document.addEventListener('DOMContentLoaded',function(){
  init();
  update();
  setTimeout(function(){updateChipTime();},3000);
  setTimeout(function(){
    var lo=document.getElementById('loadingOverlay');
    if(lo && !lo.classList.contains('hide')) lo.classList.add('hide');
  },3000);
});
var _updateTimer=null;
function scheduleUpdate(){
  if(_updateTimer)clearTimeout(_updateTimer);
  _updateTimer=setTimeout(function(){update()},3000);
}
var _histTimer=null;
function scheduleHistory(){
  if(_histTimer)clearTimeout(_histTimer);
  _histTimer=setTimeout(function(){loadHistory()},60000);
}
var _timeTimer=null;
function scheduleChipTime(){
  if(_timeTimer)clearTimeout(_timeTimer);
  _timeTimer=setTimeout(function(){updateChipTime()},30000);
}

function updateChipTime(){
  fetch('/api/now').then(function(r){return r.json()}).then(function(d){
    var el=document.getElementById('chipTime');
    if(el) el.textContent=d.str||'--:--';
    scheduleChipTime();
  }).catch(function(){scheduleChipTime();});
}
</script>
</body>
</html>)rawliteral";

void WebConfigServer::init() {
    server_ = std::make_unique<ESP8266WebServer>(WEB_SERVER_PORT);
    httpUpdater_ = std::make_unique<ESP8266HTTPUpdateServer>();
    dnsServer_ = std::make_unique<DNSServer>();

    httpUpdater_->setup(server_.get(), "/update", "admin", "admin");

    // 启动 DNS 服务器，实现 Captive Portal (强制门户) 拦截所有域名解析请求重定向到 ESP
    dnsServer_->start(53, "*", WiFi.softAPIP());

    server_->on("/", HTTP_GET, []() {
        WiFiManager::boostTxPower();  // P1: 页面访问时临时提升功率
        server_->sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
        server_->sendHeader("Pragma", "no-cache");
        server_->sendHeader("Expires", "-1");
        server_->setContentLength(sizeof(INDEX_HTML) - 1);
        server_->send(200, "text/html; charset=UTF-8", "");
        server_->sendContent_P(INDEX_HTML, sizeof(INDEX_HTML) - 1);
        // 发送完成后让出 1ms，让 lwIP/TCP 栈有机会把数据真正推出去，
        // 避免在弱信号或慢客户端场景下因缓冲区未排空导致页面空白/截断。
        delay(1);
    });

    // iOS Captive Portal 检测端点：返回 200 HTML 页面并自动跳转到配置页。
    // 若返回 "Success" 或 302 重定向，iOS 某些版本会判定已联网而不弹出门户。
    server_->on("/hotspot-detect.html", HTTP_GET, []() {
        server_->sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
        server_->sendHeader("Pragma", "no-cache");
        server_->sendHeader("Expires", "-1");
        String portalUrl = String("http://") + WiFi.softAPIP().toString() + "/";
        String html = "<!DOCTYPE html><html><head><meta charset='UTF-8'>";
        html += "<meta http-equiv='refresh' content='0; url=" + portalUrl + "'>";
        html += "<title>WiFi 配置</title></head><body>";
        html += "<p style='font-family:-apple-system,sans-serif;text-align:center;padding-top:40px'>";
        html += "请打开 <a href='" + portalUrl + "'>配置页面</a>";
        html += "</p></body></html>";
        server_->send(200, "text/html; charset=UTF-8", html);
    });

    server_->on("/api/status", HTTP_GET, []() {
        WiFiManager::boostTxPower();  // P1: 状态查询时临时提升功率
        String ip = (WiFi.status() == WL_CONNECTED) ? WiFi.localIP().toString() : WiFi.softAPIP().toString();
        uint8_t sh, sm, eh, em;
        GPIOManager::getCycleTime(sh, sm, eh, em);
        MQTTConfig mq = MQTTManager::getConfig();
        String apPass = WiFiManager::getAPPassword();

        snprintf(status_buf, sizeof(status_buf),
            "{\"conn\":%s,\"ip\":\"%s\",\"ssid\":\"%s\",\"rssi\":%d,"
            "\"ver\":\"%s\",\"up\":%lu,\"m\":%s,\"s\":%s,"
            "\"lk\":%s,\"te\":%s,\"tr\":%s,\"td\":%d,\"tl\":%lu,"
            "\"v\":%.1f,\"i\":%.3f,\"p\":%.2f,\"e\":%.2f,\"me\":%s,\"rl\":%s,"
            "\"ce\":%s,\"sh\":%d,\"sm\":%d,\"eh\":%d,\"em\":%d,\"cpc\":%d,"
            "\"pe\":%s,\"pt\":%.2f,"
            "\"be\":%s,\"bt\":%.2f,\"bm\":%.2f,\"btt\":%d,\"bmo\":%d,\"bu\":%.2f,\"bum\":%.2f,\"but\":%u,\"bsr\":%d,\"ep\":%.2f,\"mo\":%.2f,\"lm\":%.2f,"
            "\"de\":%s,\"dt\":\"%s\",\"dl\":%s,\"dr\":%d,\"dm\":\"%s\",\"dp\":%s,\"pc\":%s,\"ds\":%d,\"ts\":%d,\"om\":%s,\"bd\":%s,"
            "\"mqe\":%s,\"mqs\":\"%s\",\"mqp\":%d,\"mqu\":\"%s\",\"mqpw\":\"%s\","
            "\"ap\":\"%s\",\"aps\":\"%s\",\"host\":\"%s\",\"cv\":%d,\"bat\":%s,\"acap\":%s,\"wtpl\":%s,\"syslog\":%s,\"rst\":\"%s\"}",
            WiFiManager::isConnected() ? "true" : "false",
            ip.c_str(),
            WiFiManager::getCurrentSSID().c_str(),
            WiFiManager::getCurrentRSSI(),
            VERSION,
            millis() / 1000,
            GPIOManager::getRelayMaster() ? "true" : "false",
            GPIOManager::getRelaySlave() ? "true" : "false",
            GPIOManager::isLocked() ? "true" : "false",
            GPIOManager::isTimerEnabled() ? "true" : "false",
            GPIOManager::isTimerRunning() ? "true" : "false",
            GPIOManager::getTimerDuration(),
            GPIOManager::getTimerRemaining(),
            SY7T609::getVoltage(),
            SY7T609::getCurrent(),
            SY7T609::getPower(),
            EnergyManager::getTotalEnergy(),
            SY7T609::isEnabled() ? "true" : "false",
            GPIOManager::isRedLedEnabled() ? "true" : "false",
            GPIOManager::isCycleEnabled() ? "true" : "false",
            sh, sm, eh, em, GPIOManager::getCyclePeriodCount(),
            GPIOManager::isPowerOffEnabled() ? "true" : "false",
            GPIOManager::getPowerOffThreshold(),
            GPIOManager::isBillingEnabled() ? "true" : "false",
            GPIOManager::getBillingThreshold(),
            GPIOManager::getBillingThresholdMoney(),
            GPIOManager::getBillingThresholdTime(),
            (int)GPIOManager::getBillingMode(),
            GPIOManager::getBillingUsedEnergy() / 1000.0f,
            GPIOManager::getBillingUsedMoney(),
            GPIOManager::getBillingUsedMinutes(),
            (int)GPIOManager::getBillingStopReason(),
            GPIOManager::getEnergyPrice(),
            EnergyManager::getMonthlyEnergy() / 1000.0f,
            EnergyManager::getLastMonthEnergy() / 1000.0f,
            GPIOManager::isWiFiDetectEnabled() ? "true" : "false",
            GPIOManager::getWiFiDetectTarget().c_str(),
            GPIOManager::isWiFiDetectLinkTimer() ? "true" : "false",
            GPIOManager::getWiFiDetectRssiThreshold(),
            GPIOManager::getWiFiDetectMac().c_str(),
            GPIOManager::isWiFiDetectPresent() ? "true" : "false",
            GPIOManager::isWiFiDetectPowerChecking() ? "true" : "false",
            GPIOManager::getWiFiDetectScanSpeed(),
            GPIOManager::getTimerSource(),
            GPIOManager::getWiFiDetectRelayOnlyMaster() ? "true" : "false",
            GPIOManager::isButtonDetectEnabled() ? "true" : "false",
            mq.enabled ? "true" : "false",
            mq.server,
            mq.port,
            mq.username,
            mq.password,
            apPass.c_str(),
            WiFiManager::getAPSuffix().c_str(),
            WiFiManager::getHostname().c_str(),
            EEPROM.read(EEPROM_CARD_VISIBILITY_ADDR),
            GPIOManager::isButtonAutoTimerEnabled() ? "true" : "false",
            WiFiManager::isAutoCloseAPEnabled() ? "true" : "false",
            WiFiManager::isWiFiTxPowerLimited() ? "true" : "false",
            log_buffer_is_enabled() ? "true" : "false",
            ESP.getResetReason().c_str()
        );
        int len = strlen(status_buf);
        uint8_t cpCount = GPIOManager::getCyclePeriodCount();
        if (len > 0 && status_buf[len-1] == '}') {
            status_buf[--len] = '\0';
            len += snprintf(status_buf + len, sizeof(status_buf) - len, ",\"cp\":[");
            for (uint8_t i = 0; i < cpCount && len < (int)sizeof(status_buf) - 40; i++) {
                uint8_t psh,psm,peh,pem;
                if (GPIOManager::getCyclePeriod(i, psh, psm, peh, pem)) {
                    if (i > 0 && len < (int)sizeof(status_buf) - 1) status_buf[len++] = ',';
                    len += snprintf(status_buf + len, sizeof(status_buf) - len,
                        "{\"sh\":%d,\"sm\":%d,\"eh\":%d,\"em\":%d}", psh, psm, peh, pem);
                }
            }
            if (len < (int)sizeof(status_buf) - 20) {
                len += snprintf(status_buf + len, sizeof(status_buf) - len, "],\"card_order\":[");
                for (uint8_t i = 0; i < 6 && len < (int)sizeof(status_buf) - 10; i++) {
                    if (i > 0 && len < (int)sizeof(status_buf) - 1) status_buf[len++] = ',';
                    uint8_t v = EEPROM.read(EEPROM_CARD_ORDER_ADDR + i);
                    if (v > 5) v = i;
                    len += snprintf(status_buf + len, sizeof(status_buf) - len, "%d", v);
                }
                if (len < (int)sizeof(status_buf) - 2) {
                    len += snprintf(status_buf + len, sizeof(status_buf) - len, "]}");
                }
            }
        }
        server_->send(200, "application/json", status_buf);
    });


    // Debug API for SY7T609
    server_->on("/api/debug", HTTP_GET, []() {
        String json = "{\"log\":";
        json += "\"" + SY7T609::getDebugLog() + "\"";
        json += ",\"meterEnabled\":" + String(SY7T609::isEnabled() ? "true" : "false");
        json += ",\"meterReady\":" + String(SY7T609::isReady() ? "true" : "false");
        json += ",\"flashMode\":" + String(SY7T609::isFlashMode() ? "true" : "false");
        json += "}";
        server_->send(200, "application/json", json);
    });

    server_->on("/api/cleardebug", HTTP_POST, []() {
        SY7T609::clearDebugLog();
        server_->send(200, "application/json", "{\"ok\":true}");
    });

    server_->on("/api/relay", HTTP_GET, []() {
        String w = server_->arg("w");
        if (w == "m") {
            bool newState = !GPIOManager::getRelayMaster();
            GPIOManager::setRelayMaster(newState);
            // 关闭主继电器时，同时关闭从继电器
            if (!newState) {
                GPIOManager::setRelaySlave(false);
            }
        } else if (w == "s") {
            bool newState = !GPIOManager::getRelaySlave();
            GPIOManager::setRelaySlave(newState);
            // 开启从继电器时，同时开启主继电器
            if (newState) {
                GPIOManager::setRelayMaster(true);
            }
        }
        String response = "{\"m\":" + String(GPIOManager::getRelayMaster() ? "true" : "false") +
                          ",\"s\":" + String(GPIOManager::getRelaySlave() ? "true" : "false") + "}";
        server_->send(200, "application/json", response);
    });

