S0DX/esp8266-powerstrip/src/web_config.cpp
    server_->on("/api/cycle", HTTP_GET, []() {
        if (server_->hasArg("enabled")) {
            bool on = (server_->arg("enabled") == "true");
            GPIOManager::setCycleEnabled(on);
            server_->send(200, "application/json", "{\"enabled\":" + String(on ? "true" : "false") + "}");
            return;
        }
        if (server_->hasArg("add")) {
            uint8_t sh = server_->arg("sh").toInt();
            uint8_t sm = server_->arg("sm").toInt();
            uint8_t eh = server_->arg("eh").toInt();
            uint8_t em = server_->arg("em").toInt();
            bool ok = GPIOManager::addCyclePeriod(sh, sm, eh, em);
            server_->send(200, "application/json", ok ? "{\"ok\":true}" : "{\"ok\":false,\"error\":\"max periods\"}");
            return;
        }
        if (server_->hasArg("remove")) {
            uint8_t idx = server_->arg("remove").toInt();
            bool ok = GPIOManager::removeCyclePeriod(idx);
            server_->send(200, "application/json", ok ? "{\"ok\":true}" : "{\"ok\":false,\"error\":\"invalid index\"}");
            return;
        }
        if (server_->hasArg("sh") && server_->hasArg("eh")) {
            uint8_t sh = server_->arg("sh").toInt();
            uint8_t sm = server_->arg("sm").toInt();
            uint8_t eh = server_->arg("eh").toInt();
            uint8_t em = server_->arg("em").toInt();
            uint8_t idx = server_->hasArg("idx") ? server_->arg("idx").toInt() : 0;
            GPIOManager::setCyclePeriod(idx, sh, sm, eh, em);
            server_->send(200, "application/json", "{\"ok\":true}");
            return;
        }
        server_->send(400, "application/json", "{\"error\":\"bad request\"}");
    });

    server_->on("/api/mqtt", HTTP_POST, []() {
        MQTTConfig conf = MQTTManager::getConfig();
        if (server_->hasArg("enabled")) {
            conf.enabled = (server_->arg("enabled") == "true");
            MQTTManager::saveConfig(conf);
            server_->send(200, "application/json", "{\"enabled\":" + String(conf.enabled ? "true" : "false") + "}");
            return;
        }
        if (server_->hasArg("server")) {
            strncpy(conf.server, server_->arg("server").c_str(), sizeof(conf.server)-1);
            conf.server[sizeof(conf.server)-1] = '\0';
            conf.port = (uint16_t)server_->arg("port").toInt();
            strncpy(conf.username, server_->arg("user").c_str(), sizeof(conf.username)-1);
            conf.username[sizeof(conf.username)-1] = '\0';
            strncpy(conf.password, server_->arg("pass").c_str(), sizeof(conf.password)-1);
            conf.password[sizeof(conf.password)-1] = '\0';
            MQTTManager::saveConfig(conf);
            server_->send(200, "application/json", "{\"ok\":true}");
            return;
        }
        server_->send(400, "application/json", "{\"error\":\"bad request\"}");
    });


    server_->on("/api/lock", HTTP_GET, []() {
        bool current = GPIOManager::isLocked();
        GPIOManager::setLocked(!current);
        String response = "{\"locked\":" + String(GPIOManager::isLocked() ? "true" : "false") + "}";
        server_->send(200, "application/json", response);
    });

    // 定时器 API
    server_->on("/api/timer", HTTP_GET, []() {
        String enabled = server_->arg("enabled");
        String duration = server_->arg("duration");

        if (duration.length() > 0) {
            uint16_t mins = duration.toInt();
            GPIOManager::setTimerDuration(mins);
        }

        if (enabled.length() > 0) {
            bool en = (enabled == "true");
            GPIOManager::setTimerEnabled(en);
            if (en) {
                GPIOManager::startTimer();
            } else {
                GPIOManager::stopTimer();
            }
            String response = "{\"enabled\":" + String(en ? "true" : "false") + ",\"duration\":" + String(GPIOManager::getTimerDuration()) + "}";
            server_->send(200, "application/json", response);
        } else if (duration.length() > 0) {
            String response = "{\"duration\":" + String(GPIOManager::getTimerDuration()) + "}";
            server_->send(200, "application/json", response);
        } else {
            server_->send(400, "application/json", "{\"error\":\"Invalid parameters\"}");
        }
    });

    server_->on("/api/card_order", HTTP_GET, []() {
        uint8_t order[6] = {0,1,2,3,4,5};
        for(int i=0;i<6;i++) order[i] = EEPROM.read(EEPROM_CARD_ORDER_ADDR+i);
        bool dup = false;
        for(int i=0;i<6 && !dup;i++) for(int j=i+1;j<6;j++) if(order[i]==order[j]) dup=true;
        if(order[0]>5||order[1]>5||order[2]>5||order[3]>5||order[4]>5||order[5]>5||dup){
            for(int i=0;i<6;i++) order[i]=i;
        }
        String json = "{\"order\":[";
        for(int i=0;i<6;i++){if(i>0)json+=',';json+=String(order[i]);}
        json += "]}";
        server_->send(200, "application/json", json);
    });

    server_->on("/api/card_order", HTTP_POST, []() {
        String body = server_->arg("plain");
        int s=body.indexOf('['), e=body.indexOf(']');
        if(s>=0 && e>s){
            String arr = body.substring(s+1, e);
            for(int idx=0; idx<6; idx++){
                int c=arr.indexOf(',');
                String num = (c>=0)?arr.substring(0,c):arr;
                int v = num.toInt();
                if(v<0||v>5) v=idx;
                EEPROM.write(EEPROM_CARD_ORDER_ADDR+idx, (uint8_t)v);
                if(c<0) break;
                arr = arr.substring(c+1);
            }
            EEPROM.commit();
        }
        server_->send(200, "application/json", "{\"ok\":true}");
    });

    server_->on("/api/card_visibility", HTTP_POST, []() {
        String body = server_->arg("plain");
        int s = body.indexOf(':'), e = body.indexOf('}');
        if (s >= 0 && e > s) {
            String val = body.substring(s + 1, e);
            val.trim();
            uint8_t v = (uint8_t)val.toInt();
            EEPROM.write(EEPROM_CARD_VISIBILITY_ADDR, v);
            EEPROM.commit();
        }
        server_->send(200, "application/json", "{\"ok\":true}");
    });

    server_->on("/api/button_auto_timer", HTTP_GET, []() {
        String enabled = server_->arg("enabled");
        GPIOManager::setButtonAutoTimerEnabled(enabled == "true");
        server_->send(200, "application/json", "{\"ok\":true}");
    });

    server_->on("/api/ap_suffix", HTTP_GET, []() {
        uint8_t v = EEPROM.read(EEPROM_AP_SUFFIX_ADDR);
        server_->send(200, "application/json", "{\"suffix\":" + String(v) + "}");
    });

