S0DX/esp8266-powerstrip/src/web_config.cpp
    server_->on("/api/crash_log", HTTP_GET, []() {
        char crash_logs[CRASH_LOG_MAX_LINES][CRASH_LOG_LINE_LEN];
        int crash_count = 0;
        bool has_crash = log_buffer_load_crash_logs(crash_logs, CRASH_LOG_MAX_LINES, &crash_count);
        String json = "{";
        json += "\"reason\":\"";
        String reason = ESP.getResetReason();
        for (size_t i = 0; i < reason.length(); i++) {
            char c = reason[i];
            if (c == '"' || c == '\\') json += '\\';
            if (c >= 32 && c <= 126) json += c; else json += '?';
        }
        json += "\",\"logs\":[";
        if (has_crash) {
            for (int i = 0; i < crash_count; i++) {
                if (i > 0) json += ",";
                json += "\"";
                for (int j = 0; crash_logs[i][j]; j++) {
                    char c = crash_logs[i][j];
                    if (c == '"' || c == '\\') json += '\\';
                    if (c == '\n') {
                        json += "\\n";
                    } else if (c == '\r') {
                        json += "\\r";
                    } else if ((unsigned char)c >= 32 && (unsigned char)c <= 126) {
                        json += c;
                    } else {
                        json += '?';
                    }
                }
                json += "\"";
            }
        }
        json += "]}";
        server_->send(200, "application/json", json);
    });

    server_->on("/api/meter", HTTP_GET, []() {
        String action = server_->arg("a");
        if (action == "on") {
            SY7T609::setEnabled(true);
        } else if (action == "off") {
            SY7T609::setEnabled(false);
        }
        String response = "{\"enabled\":" + String(SY7T609::isEnabled() ? "true" : "false") + "}";
        server_->send(200, "application/json", response);
    });

    // 电表校准 API（P1）
    // a=v&v=220.0   电压自动校准
    // a=i&v=4.545   电流自动校准
    // a=reset       恢复出厂校准
    // a=save        保存当前寄存器到芯片 flash
    // a=clear       清零电能计数器
    server_->on("/api/meter_calib", HTTP_GET, []() {
        String action = server_->arg("a");
        String response;
        if (SY7T609::isFlashMode()) {
            response = "{\"ok\":false,\"error\":\"flash mode\"}";
        } else if (!SY7T609::isReady()) {
            response = "{\"ok\":false,\"error\":\"meter not ready\"}";
        } else if (action == "v") {
            float v = server_->arg("v").toFloat();
            bool ok = SY7T609::calibrateVoltage(v);
            response = "{\"ok\":" + String(ok ? "true" : "false") + ",\"action\":\"voltage\"}";
        } else if (action == "i") {
            float i = server_->arg("v").toFloat();
            bool ok = SY7T609::calibrateCurrent(i);
            response = "{\"ok\":" + String(ok ? "true" : "false") + ",\"action\":\"current\"}";
        } else if (action == "reset") {
            bool ok = SY7T609::resetCalibration();
            response = "{\"ok\":" + String(ok ? "true" : "false") + ",\"action\":\"reset\"}";
        } else if (action == "save") {
            bool ok = SY7T609::saveCalibration();
            response = "{\"ok\":" + String(ok ? "true" : "false") + ",\"action\":\"save\"}";
        } else if (action == "clear") {
            bool ok = SY7T609::clearEnergyCounter();
            response = "{\"ok\":" + String(ok ? "true" : "false") + ",\"action\":\"clear\"}";
        } else {
            response = "{\"ok\":false,\"error\":\"invalid action\"}";
        }
        server_->send(200, "application/json", response);
    });

    server_->on("/api/history", HTTP_GET, []() {
        String json = "{\"data\":[";
        for (int i = 0; i < 7; i++) {
            if (i > 0) json += ",";
            json += String(EnergyManager::getHistory(i), 2);
        }
        json += "]}";
        server_->send(200, "application/json", json);
    });

    server_->on("/api/poweroff", HTTP_GET, []() {
        if (server_->hasArg("enabled")) {
            bool en = (server_->arg("enabled") == "true");
            GPIOManager::setPowerOffEnabled(en);
        }
        if (server_->hasArg("threshold")) {
            float th = server_->arg("threshold").toFloat();
            GPIOManager::setPowerOffThreshold(th);
        }
        char buf[128];
        snprintf(buf, sizeof(buf), "{\"enabled\":%s,\"threshold\":%.2f}",
            GPIOManager::isPowerOffEnabled() ? "true" : "false",
            GPIOManager::getPowerOffThreshold());
        server_->send(200, "application/json", buf);
    });

    server_->on("/api/billing", HTTP_GET, []() {
        if (server_->hasArg("enabled")) {
            bool en = (server_->arg("enabled") == "true");
            GPIOManager::setBillingEnabled(en);
        }
        if (server_->hasArg("threshold")) {
            float th = server_->arg("threshold").toFloat();
            GPIOManager::setBillingThreshold(th);
        }
        if (server_->hasArg("money")) {
            float money = server_->arg("money").toFloat();
            GPIOManager::setBillingThresholdMoney(money);
        }
        if (server_->hasArg("time")) {
            int minutes = server_->arg("time").toInt();
            GPIOManager::setBillingThresholdTime((uint16_t)minutes);
        }
        if (server_->hasArg("mode")) {
            int mode = server_->arg("mode").toInt();
            if (mode >= 0 && mode <= 2) {
                GPIOManager::setBillingMode((GPIOManager::BillingMode)mode);
            }
        }
        char buf[256];
        snprintf(buf, sizeof(buf),
            "{\"enabled\":%s,\"mode\":%d,\"threshold\":%.2f,\"money\":%.2f,\"time\":%d,\"used\":%.2f,\"usedMoney\":%.2f,\"usedTime\":%u,\"stopReason\":%d,\"startEnergy\":%.2f,\"price\":%.2f}",
            GPIOManager::isBillingEnabled() ? "true" : "false",
            (int)GPIOManager::getBillingMode(),
            GPIOManager::getBillingThreshold(),
            GPIOManager::getBillingThresholdMoney(),
            GPIOManager::getBillingThresholdTime(),
            GPIOManager::getBillingUsedEnergy() / 1000.0f,
            GPIOManager::getBillingUsedMoney(),
            GPIOManager::getBillingUsedMinutes(),
            (int)GPIOManager::getBillingStopReason(),
            GPIOManager::getBillingStartEnergy() / 1000.0f,
            GPIOManager::getEnergyPrice());
        server_->send(200, "application/json", buf);
    });

