S0DX/esp8266-powerstrip/src/web_config.cpp
    server_->on("/api/billing", HTTP_POST, []() {
        if (server_->hasArg("price")) {
            float price = server_->arg("price").toFloat();
            if (price > 0 && price < 10) {
                GPIOManager::setEnergyPrice(price);
            }
        }
        if (server_->hasArg("mode")) {
            int mode = server_->arg("mode").toInt();
            if (mode >= 0 && mode <= 2) {
                GPIOManager::setBillingMode((GPIOManager::BillingMode)mode);
            }
        }
        if (server_->hasArg("money")) {
            float money = server_->arg("money").toFloat();
            GPIOManager::setBillingThresholdMoney(money);
        }
        if (server_->hasArg("time")) {
            int minutes = server_->arg("time").toInt();
            GPIOManager::setBillingThresholdTime((uint16_t)minutes);
        }
        if (server_->hasArg("threshold")) {
            float th = server_->arg("threshold").toFloat();
            GPIOManager::setBillingThreshold(th);
        }
        server_->send(200, "application/json", "{\"ok\":true}");
    });

    server_->on("/api/billing/history", HTTP_GET, []() {
        String json = "{\"ok\":true,\"history\":[";
        uint8_t count = GPIOManager::getBillingHistoryCount();
        for (uint8_t i = 0; i < count; i++) {
            GPIOManager::BillingRecord rec = GPIOManager::getBillingHistory(i);
            char item[128];
            snprintf(item, sizeof(item),
                "{\"startTime\":%u,\"usedEnergy\":%.2f,\"cost\":%.2f}%s",
                rec.startTime, rec.usedEnergyWh, rec.costCents / 100.0f,
                (i < count - 1) ? "," : "");
            json += item;
        }
        json += "]}";
        server_->send(200, "application/json", json);
    });

    server_->on("/api/time", HTTP_GET, []() {
        if (server_->hasArg("ts")) {
            time_t ts = server_->arg("ts").toInt();
            struct timeval tv = { .tv_sec = ts, .tv_usec = 0 };
            settimeofday(&tv, NULL);
            configTime(8 * 3600, 0, "pool.ntp.org", "time.nist.gov");
        }
        server_->send(200, "text/plain", "OK");
    });

    server_->on("/api/now", HTTP_GET, []() {
        time_t now = time(nullptr);
        struct tm* timeinfo = localtime(&now);
        char buf[64];
        if (timeinfo && timeinfo->tm_year >= 100) {
            snprintf(buf, sizeof(buf), "{\"ok\":true,\"hour\":%d,\"min\":%02d,\"str\":\"%02d:%02d\"}",
                timeinfo->tm_hour, timeinfo->tm_min,
                timeinfo->tm_hour, timeinfo->tm_min);
        } else {
            snprintf(buf, sizeof(buf), "{\"ok\":false,\"str\":\"--:--\"}");
        }
        server_->send(200, "application/json", buf);
    });

    server_->on("/api/wifidetect", HTTP_GET, []() {
        if (server_->hasArg("enabled")) {
            GPIOManager::setWiFiDetectEnabled(server_->arg("enabled") == "true");
        }
        if (server_->hasArg("target")) {
            GPIOManager::setWiFiDetectTarget(server_->arg("target").c_str());
        }
        if (server_->hasArg("timeout")) {
            GPIOManager::setWiFiDetectTimeout(server_->arg("timeout").toInt());
        }
        if (server_->hasArg("linkTimer")) {
            GPIOManager::setWiFiDetectLinkTimer(server_->arg("linkTimer") == "true");
        }
        if (server_->hasArg("rssi")) {
            GPIOManager::setWiFiDetectRssiThreshold(server_->arg("rssi").toInt());
        }
        if (server_->hasArg("scanSpeed")) {
            GPIOManager::setWiFiDetectScanSpeed((uint8_t)server_->arg("scanSpeed").toInt());
        }
        if (server_->hasArg("onlyMaster")) {
            GPIOManager::setWiFiDetectRelayOnlyMaster(server_->arg("onlyMaster") == "true");
        }
        char buf[256];
        snprintf(buf, sizeof(buf), "{\"enabled\":%s,\"target\":\"%s\",\"timeout\":%d,\"linkTimer\":%s,\"rssi\":%d,\"scanSpeed\":%d,\"mac\":\"%s\",\"present\":%s,\"powerCheck\":%s,\"onlyMaster\":%s}",
            GPIOManager::isWiFiDetectEnabled() ? "true" : "false",
            GPIOManager::getWiFiDetectTarget().c_str(),
            GPIOManager::getWiFiDetectTimeout(),
            GPIOManager::isWiFiDetectLinkTimer() ? "true" : "false",
            GPIOManager::getWiFiDetectRssiThreshold(),
            GPIOManager::getWiFiDetectScanSpeed(),
            GPIOManager::getWiFiDetectMac().c_str(),
            GPIOManager::isWiFiDetectPresent() ? "true" : "false",
            GPIOManager::isWiFiDetectPowerChecking() ? "true" : "false",
            GPIOManager::getWiFiDetectRelayOnlyMaster() ? "true" : "false");
        server_->send(200, "application/json", buf);
    });

    server_->on("/api/button_detect", HTTP_GET, []() {
        if (server_->hasArg("enabled")) {
            GPIOManager::setButtonDetectEnabled(server_->arg("enabled") == "true");
        }
        char buf[64];
        snprintf(buf, sizeof(buf), "{\"enabled\":%s}",
            GPIOManager::isButtonDetectEnabled() ? "true" : "false");
        server_->send(200, "application/json", buf);
    });

    // 扫描 WiFi 网络（改为异步扫描并在等待期间喂狗，避免同步阻塞触发 Hardware Watchdog）
    server_->on("/api/scan", HTTP_GET, []() {
        int8_t scanStatus = WiFi.scanComplete();
        if (scanStatus == WIFI_SCAN_RUNNING) {
            // 已有扫描在运行，等待其完成
            unsigned long scanStart = millis();
            while (WiFi.scanComplete() == WIFI_SCAN_RUNNING) {
                yield();
                ESP.wdtFeed();
                if (millis() - scanStart > 10000) {
                    server_->send(200, "application/json", "[]");
                    return;
                }
            }
            scanStatus = WiFi.scanComplete();
        } else if (scanStatus < 0) {
            // 启动新异步扫描
            WiFi.scanNetworks(true, true);
            unsigned long scanStart = millis();
            while (WiFi.scanComplete() == WIFI_SCAN_RUNNING) {
                yield();
                ESP.wdtFeed();
                if (millis() - scanStart > 10000) {
                    WiFi.scanDelete();
                    server_->send(200, "application/json", "[]");
                    return;
                }
            }
            scanStatus = WiFi.scanComplete();
        }

        if (scanStatus < 0) {
            WiFi.scanDelete();
            server_->send(200, "application/json", "[]");
            return;
        }

        int n = scanStatus;
        struct WiFiAP { String ssid; int rssi; bool enc; };
        WiFiAP aps[32];
        int apCount = 0;
        for (int i = 0; i < n && apCount < 32; i++) {
            String ssid = WiFi.SSID(i);
            int rssi = WiFi.RSSI(i);
            bool enc = (WiFi.encryptionType(i) != ENC_TYPE_NONE);
            bool found = false;
            for (int j = 0; j < apCount; j++) {
                if (aps[j].ssid == ssid) {
                    found = true;
                    if (rssi > aps[j].rssi) {
                        aps[j].rssi = rssi;
                        aps[j].enc = enc;
                    }
                    break;
                }
            }
            if (!found) {
                aps[apCount++] = {ssid, rssi, enc};
            }
        }
        String json = "[";
        for (int i = 0; i < apCount; i++) {
            if (i > 0) json += ",";
            json += "{\"ssid\":\"" + aps[i].ssid + "\",\"rssi\":" + aps[i].rssi + ",\"enc\":" + (aps[i].enc ? "true" : "false") + "}";
        }
        json += "]";
        WiFi.scanDelete();
        server_->send(200, "application/json", json);
    });

    server_->on("/api/reset_energy", HTTP_POST, []() {
        EnergyManager::reset();
        // 计费会话和历史记录同时清零
        GPIOManager::setBillingStartEnergy(0);
        EEPROM.write(EEPROM_BILLING_HISTORY_COUNT_ADDR, 0);
        for (int i = 0; i < EEPROM_BILLING_HISTORY_MAX * EEPROM_BILLING_RECORD_SIZE; i++) {
            EEPROM.write(EEPROM_BILLING_HISTORY_ADDR + i, 0);
        }
        EEPROM.commit();
        server_->send(200, "application/json", "{\"ok\":true}");
    });

    server_->onNotFound([]() {
        // Captive Portal：AP 模式下所有未匹配请求重定向到配置页。
        // 使用 AP IP 而非 .local 主机名，避免 iOS 某些版本因 mDNS 解析未完成而无法弹出门户。
        String host = WiFiManager::getMDNSHostname();
        if (host.length() == 0) host = "power";
        IPAddress apIP = WiFi.softAPIP();
        String portalUrl;
        if (apIP[0] != 0) {
            portalUrl = String("http://") + apIP.toString() + "/";
        } else {
            portalUrl = String("http://") + host + ".local/";
        }
        server_->sendHeader("Location", portalUrl, true);
        server_->send(302, "text/plain", "");
    });

    server_->begin();
    DBG_PRINTF("[Web] Server started on port %d\n", WEB_SERVER_PORT);
    DBG_PRINTF("[OTA] Update endpoint: /update (user:admin pass:admin)\n");
}

void WebConfigServer::handle() {
    // 每次循环处理多个 DNS/Web 请求，降低高并发或慢客户端场景下的超时概率
    if (dnsServer_) {
        for (int i = 0; i < 4; i++) {
            dnsServer_->processNextRequest();
        }
    }
    // P0: 标记 Web 请求处理中，主循环检测到此标志时跳过 SY7T609 读取等阻塞操作
    // 50ms 超时保护（在 isWebRequestActive 中实现）防止死锁
    markWebRequestStart();
    for (int i = 0; i < 2; i++) {
        server_->handleClient();
    }
    markWebRequestEnd();
}

void WebConfigServer::setSaveCallback(void (*callback)(const char*, const char*)) {
    save_callback_ = callback;
}